[
    {
        "content": "<p>Hey everyone!</p>\n<p>I was curious if anyone is familiar with plotting data using a windrose on the Glade JupyterHub? This is my first time trying to plot a windrose and the only function that I have seen used in examples is from the \"windrose\" library (<a href=\"https://windrose.readthedocs.io/en/latest/index.html\">https://windrose.readthedocs.io/en/latest/index.html</a>), but when I try importing this library in Jupyter it seems to not recognize it. I have tried to download this library on JupyterHub as well although it seems that did not do the trick either, so I figured I'd hop on here and see if anyone has run into this before and knows how to make \"windrose\" work or if there is a better way to plot a windrose on JupyterHub?</p>\n<p>Best,<br>\nBrendan</p>",
        "id": 48565,
        "sender_full_name": "Brendan Myers",
        "timestamp": 1640817748
    },
    {
        "content": "<p>This will depend on what kernel you're using on JupyterHub and if the library has been installed. The default slim Python kernel doens't have this library, but the NPL might (I haven't looked). Alternatively, you could create your own environment via <code>conda</code> or tool of choice.</p>",
        "id": 48631,
        "sender_full_name": "Jared Baker",
        "timestamp": 1641253817
    },
    {
        "content": "<p>Thanks for all the tips Jared! That makes sense, I've been using the CMIP6 kernel and just checked the NPL kernel and none of the kernels I've tried seem to have \"windrose\" installed... Any tips and tricks on creating my own kernel in JupyterHub or any resources that you know of that I can use to figure it out?</p>",
        "id": 48709,
        "sender_full_name": "Brendan Myers",
        "timestamp": 1641406341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193\">@Brendan Myers</span>  Here are my steps to clone a NPL conda environment and install windrose into it (I'm a bash user):</p>\n<div class=\"codehilite\"><pre><span></span><code>ml conda\n. $(dirname $(which conda))/../etc/profile.d/conda.sh\nconda env list\nconda env create -n my-npl --clone npl-2201\nconda create -n my-npl --clone npl-2201\nconda activate my-npl\nconda search -c conda-forge windrose\nconda install -c conda-forge windrose\npython -c &#39;import windrose&#39;\n</code></pre></div>",
        "id": 48824,
        "sender_full_name": "Jared Baker",
        "timestamp": 1641525554
    },
    {
        "content": "<p>Wow great! That worked! Sorry for the slow response but thank you so much for the help, I really appreciate it!</p>",
        "id": 49279,
        "sender_full_name": "Brendan Myers",
        "timestamp": 1642113764
    }
]