[
    {
        "content": "<p>Hi All,</p>\n<p>Hello Colleagues,</p>\n<p>Please consider submitting your work to our session on FAIR and Open<br>\nData and Software within the Atmospheric and Ocean Sciences to Support<br>\nTransparent, Reusable and Efficient Research at the January 2023 AMS<br>\nAnnual Meeting! Abstracts are due Aug 24.</p>\n<p><a href=\"https://ams.confex.com/ams/103ANNUAL/webprogrampreliminary/Session62154.html\">https://ams.confex.com/ams/103ANNUAL/webprogrampreliminary/Session62154.html</a></p>\n<p>Description:</p>\n<p>The need to understand linkages between climatic extremes and security<br>\noutcomes such as displacement/migration, public health, and<br>\nfood/electricity production has never been higher. Analysis of these<br>\nlinkages requires integration of the Earth, social, economic, and<br>\npolitical sciences as well as equitable access to community datasets,<br>\ndata proximate compute, community developed data analysis workflows<br>\nand open source software tools. In this session, we invite submissions<br>\nthat discuss research, applications and initiatives that build upon<br>\nthe principles of FAIR (Findable, Accessible, Interoperable, and<br>\nReusable) Open Data and Software within the atmospheric and related<br>\nsciences to drive new discoveries. We welcome technical, policy, and<br>\ncommunity-focused submissions on a range of topics related to<br>\nfacilitating transparency of science and leveraging community<br>\nsupported open science capabilities to drive research and operational<br>\noutcomes. Examples include:</p>\n<p>1.Research, operations and industry uses that employ a combination of<br>\npublic cloud compute, cloud hosted datasets such as those provided<br>\nthrough NOAA’s Open Data Dissemination Program, and open source data<br>\nanalysis tools and workflows.<br>\n2.Solutions for data and software discoverability, metadata creation<br>\nand management, provenance tracking, and other relevant topics.</p>\n<p>Platforms for reproducible research and reusable tools will accelerate<br>\nthe analytics enterprise and build the salience, credibility, and<br>\nlegitimacy required to effectively inform policy. This session will<br>\nhighlight emerging open-science tools and platforms for weather and<br>\nclimate-security analysis.</p>",
        "id": 61829,
        "sender_full_name": "Doug Schuster",
        "timestamp": 1660841609
    }
]