[
    {
        "content": "<p>Here are a couple of papers just out examining the impacts of mesoscale eddies on productivity in the Southern Ocean: <br>\n<a href=\"https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019GB006385\" target=\"_blank\" title=\"https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019GB006385\">https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019GB006385</a><br>\n<a href=\"https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019GB006380\" target=\"_blank\" title=\"https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019GB006380\">https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2019GB006380</a></p>",
        "id": 10328,
        "sender_full_name": "Matt Long",
        "timestamp": 1591208044
    },
    {
        "content": "<p><a href=\"https://doi.org/10.1029/2020GB006531\" target=\"_blank\" title=\"https://doi.org/10.1029/2020GB006531\">Potential Predictability of Net Primary Production in the Ocean</a></p>\n<p>Marine net primary production (NPP) is the base of the marine food web, as well as an important component of the ocean carbon cycle. Year‐to‐year variations in NPP can influence the availability of living marine resources, such as fish. In this study, we show that an Earth System Model can be used to generate near‐term (1 to 10 years) forecasts of marine NPP. Earth System Model‐based forecasts of NPP show an improvement over a persistence forecast, where NPP the following year is assumed to be the same as the current year's NPP. Annual NPP variations can be predicted for 1 to 3 years in advance in many oceanic regions, from temperate waters to the tropics. NPP in colder regions, however, is harder to predict. The main drivers of NPP influence its predictability. Places where nutrient availability primarily drives variations in NPP are more predictable than regions of the ocean where light and temperature are the main drivers (primarily high latitude regions). We further demonstrate NPP predictability in coastal regions, the world's Large Marine Ecosystems. We show that NPP predictions could be potentially useful in many Large Marine Ecosystems, and this may help to sustainably manage coastal marine ecosystems.</p>",
        "id": 10837,
        "sender_full_name": "Matt Long",
        "timestamp": 1591720781
    }
]