[
    {
        "content": "<p>I just sent this email to <a href=\"mailto:projectpythia@ucar.edu\">projectpythia@ucar.edu</a>. Please forward to any other folks who might've missed the email! Let me know if there's any document access issues.</p>\n<blockquote>\n<p><strong>By our next Pythia EWG Meeting, Monday 7/31,</strong> please asynchronously populate <strong><a href=\"https://docs.google.com/document/d/1GavZFeCmS_aNhCjEn2RtrTIJ0JZJKMcENpK9SaTibZs/edit?usp=sharing\">this list</a></strong> of criteria Project Pythia will use to review Cookbook submissions. Please take a look even if you do not regularly participate in the weekly EWG meeting.<br>\n​<br>\nThe goal of this is to create a sustainable process that keeps Cookbook submissions moving forward, effectively balances workload across maintainers and contributors, and increases communication and documentation throughout the process.</p>\n<p>We will dedicate most of that EWG meeting to distilling the criteria down and exploring the process of the review itself (number of reviewers, \"internal\" vs \"external\", tools of choice, etc.) based on the criteria we end up with.</p>\n<p>If you have any questions or other feedback on this process, let me know! Look out for a separate Discourse post today or tomorrow to solicit broader community input as well.</p>\n</blockquote>",
        "id": 85708,
        "sender_full_name": "Drew Camron",
        "timestamp": 1689706556
    },
    {
        "content": "<p>and please use this zulip topic for feedback and iteration in the mean time!</p>",
        "id": 85709,
        "sender_full_name": "Drew Camron",
        "timestamp": 1689706571
    },
    {
        "content": "<p><a href=\"https://discourse.pangeo.io/t/how-should-project-pythia-review-cookbook-submissions/3583\">Discourse post</a> is now up. Please continue to populate the criteria document <strong>before</strong> next week's EWG.</p>",
        "id": 85918,
        "sender_full_name": "Drew Camron",
        "timestamp": 1690230133
    }
]