[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12\">@Julia Kent</span> are you available for tomorrow morning's OWG? I understand <span class=\"user-mention\" data-user-id=\"50\">@Kevin Tyle</span> and <span class=\"user-mention\" data-user-id=\"134\">@Max Grover</span> are likely out? Let us know when you're around, Max!</p>\n<p>Let's plan to meet (and more broadly invite Pythia folks) to lay out last-week action items and reconvene later in the week to wrap up before the hackathon.</p>",
        "id": 82701,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686599765
    },
    {
        "content": "<p>Yes I can be there! Let's still talk. I have questions about the tutorials</p>",
        "id": 82703,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686606988
    },
    {
        "content": "<p>Hi y'all, I'm having a total internet outage at home (multiple times in weeks, thanks Xfinity.) I should be able to make it work, but I might be a bit late or reduced connection</p>",
        "id": 82709,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686667377
    },
    {
        "content": "<p>Hi Drew I'm so sorry but I thought I had a meeting 10-4 for the CISL event, but it starts at 9.</p>",
        "id": 82710,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686667519
    },
    {
        "content": "<p>Can we talk here about it instead of meeting?</p>",
        "id": 82711,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686667535
    },
    {
        "content": "<p>If my connection allows, I'll plan to meet with <span class=\"user-mention\" data-user-id=\"49\">@Brian Rose</span> to lay out action items and facilitation ideas, then I can recap it here and we can see when we can meet later in the week. No problem!</p>",
        "id": 82712,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686668144
    },
    {
        "content": "<p>Thank you! What tutorials are we giving and who is leading them on Day 1 is my main question. I will respond in this channel if you have any questions I might be able to answer.</p>",
        "id": 82713,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686668687
    },
    {
        "content": "<p>And what are your thoughts on the Google Slides for project proposals: <a href=\"https://docs.google.com/presentation/d/1aLlcHnpLHiuRv4L4d3vEyAw9Ij53YS_is9rkfNyB0r8/edit#slide=id.g22706e90d2d_0_0\">https://docs.google.com/presentation/d/1aLlcHnpLHiuRv4L4d3vEyAw9Ij53YS_is9rkfNyB0r8/edit#slide=id.g22706e90d2d_0_0</a></p>",
        "id": 82714,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686669456
    },
    {
        "content": "<p>You're way ahead of us here! We agreed we should put something like this together; I didn't see your message. Thanks for starting on this</p>",
        "id": 82716,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686677142
    },
    {
        "content": "<p>Our current plan is a few breakout tutorials, maybe ~90 minutes (with break/flex time) per number:<br>\n1.) a group-wide tutorial on the process of creating a cookbook (starting from the template, etc.) - unassigned presenter<br>\n2a.) facilitator support, the logistics of running the breakouts and assigning some virtual moderators, etc. - unassigned presenter(s)<br>\n2b.) general intro content, from zero to jupyterbook - max and brian both have some content here, but we may split up the load</p>",
        "id": 82717,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686677284
    },
    {
        "content": "<p>We also talked about the first hour morning plenary, and roughly decided (1) High-level overview of Project Pythia and state of Cookbooks (Brian leads), followed by (2) Hackathon goals and logistics (Drew leads).</p>",
        "id": 82719,
        "sender_full_name": "Brian Rose",
        "timestamp": 1686677553
    },
    {
        "content": "<p>The slides are a little messy right now because I want to update them to use the UCAR template</p>",
        "id": 82720,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686677876
    },
    {
        "content": "<p>Cleaned up the slides now. Should I send them out to people who said they might be interested in leading sessions by the end of the day today?</p>",
        "id": 82724,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686683091
    },
    {
        "content": "<p>Also let me know what else we want power point slides for - the introduction? I might be able to put together something with the same template.</p>\n<p>We can duplicate these slides and make edits for the report-outs.</p>",
        "id": 82725,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686683268
    },
    {
        "content": "<p>I think Brian was going to spin that up and then start to poke us with potentially edits, etc.</p>",
        "id": 82726,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686686059
    },
    {
        "content": "<p>Separately, we decided to open up a Slack workspace for hybrid and virtual communication and connection across participants and facilitators. We considered using the Zulip, but we assumed that would be burdensome for the Zulip maintainers and for accessibility to new users. <span class=\"user-mention\" data-user-id=\"12\">@Julia Kent</span> <span class=\"user-mention\" data-user-id=\"19\">@John Clyne</span> etc., is this the right read? Or is there a push to use the Zulip for more broad engagement?</p>",
        "id": 82727,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686686197
    },
    {
        "content": "<p>My read is that more people are familiar with Slack than Zulip in general. I think either could be a good idea though</p>",
        "id": 82728,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686686435
    },
    {
        "content": "<p>Hi all! <a href=\"https://join.slack.com/t/slack-tbo1206/shared_invite/zt-1x0b63gtz-Khsfo3ULXerV9ehgtNk0ww\">Here</a> is the join link for our Hackathon Slack workspace. Let's take some time tomorrow to populate it with a basic channel structure and some welcome messages, topics, etc. Then we can make sure to get the link out to registrants by the end of the day tomorrow!</p>",
        "id": 82739,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686717750
    },
    {
        "content": "<p>(you all also should've received invites to your workplace e-mail addresses)</p>",
        "id": 82740,
        "sender_full_name": "Drew Camron",
        "timestamp": 1686717765
    },
    {
        "content": "<p>Okay great thanks Drew. </p>\n<p>In our next email we should:</p>\n<ul>\n<li>send out the Slack link</li>\n<li>send the slides link and invite people to fill out their project pitch with as much detail as they want</li>\n<li>remind them to bring headphones for a virtual meeting</li>\n<li>send the run of show schedule as read only with the Zoom meeting links</li>\n</ul>",
        "id": 82741,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686753848
    },
    {
        "content": "<p>Where I'm at lost power so I can only work from my phone atm and am going to be busy away from my computer to COB today</p>",
        "id": 82742,
        "sender_full_name": "Julia Kent",
        "timestamp": 1686753885
    },
    {
        "content": "<p>Hi all, can I suggest that we migrate our hackathon-related conversations over to Slack instead of here. One less tab to keep open this week! We can create a private channel on the Slack for hackathon organizers.</p>",
        "id": 82743,
        "sender_full_name": "Brian Rose",
        "timestamp": 1686757647
    }
]