[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"12\">@Julia Kent</span> <span class=\"user-mention\" data-user-id=\"49\">@Brian Rose</span> <span class=\"user-mention\" data-user-id=\"50\">@Kevin Tyle</span> <span class=\"user-mention\" data-user-id=\"134\">@Max Grover</span> <span class=\"user-mention\" data-user-id=\"293\">@Robert Ford</span> </p>\n<p>Unidata + COMET is working with USGS on <a href=\"https://ral.ucar.edu/projects/hytest\">HyTEST</a> for broad education and training goals. They're interested in is offering their own version of our Cookbook Hackathon and producing some Cookbook content. They were looking for a rundown of how we ran it, some of the do's and dont's we took away from the hackathon, and considerations for whether they should run it primarily for a USGS audience or open it more broadly to the community. I gave my perspective and have offered for COMET's person on this to come chat with us.</p>\n<p>I can't be at the upcoming EWG, but they'd like to chat sooner rather than later (and are looking to spend money.) Are y'all interested in a separate meeting with COMET on this, or would an existing meeting (8/21 IWG, 8/22 OWG, or 8/28 EWG) be the best fit to have you all as part of this discussion?</p>",
        "id": 86986,
        "sender_full_name": "Drew Camron",
        "timestamp": 1691598318
    },
    {
        "content": "<p>They'd be trying to offer something like this before July 2024</p>",
        "id": 86993,
        "sender_full_name": "Drew Camron",
        "timestamp": 1691598468
    },
    {
        "content": "<p>I'm working on getting our Hackathon scheduled for next summer. Would it make sense to join forces? Would they consider contributing directly to the Pythia collection, taking advantage of all our infrastructure, support, community, etc.? With appropriate tagging, and maybe a little infrastructure work, they could essentially have their own HyTEST gallery</p>",
        "id": 86995,
        "sender_full_name": "John Clyne",
        "timestamp": 1691601287
    },
    {
        "content": "<p>Those times work for me. I echo John's questions :)</p>",
        "id": 86997,
        "sender_full_name": "Julia Kent",
        "timestamp": 1691602744
    },
    {
        "content": "<p>I believe the plan would be to directly contribute within our space, yes. But we could try and get that info from them</p>",
        "id": 87013,
        "sender_full_name": "Drew Camron",
        "timestamp": 1691604946
    },
    {
        "content": "<p>Any of those meeting dates would work for me.</p>",
        "id": 87020,
        "sender_full_name": "Kevin Tyle",
        "timestamp": 1691608279
    },
    {
        "content": "<p>That is awesome - I think a separate meeting might be more helpful</p>",
        "id": 87135,
        "sender_full_name": "Max Grover",
        "timestamp": 1691768755
    },
    {
        "content": "<p>Sorry I'm late to this thread. FYI <span class=\"user-mention\" data-user-id=\"169\">@Drew Camron</span> we have some specific language in our recently funded new Pythia NSF proposal to collaborate with USGS on spinning HyTEST content into Cookbooks. Amelia Snyder from USGS is identified as a zero-cost collaborator on this.</p>",
        "id": 87199,
        "sender_full_name": "Brian Rose",
        "timestamp": 1692031337
    },
    {
        "content": "<p>Excellent, all the more reason to get them directly in the room!</p>",
        "id": 87209,
        "sender_full_name": "Drew Camron",
        "timestamp": 1692041151
    },
    {
        "content": "<p>Be happy to tag along, wonder if it's mainly USGS hydro people or rock people</p>",
        "id": 87272,
        "sender_full_name": "Thomas Martin",
        "timestamp": 1692122950
    }
]