[
    {
        "content": "<p><strong>Private, shared history</strong> stream created by <span class=\"user-mention silent\" data-user-id=\"311\">Elena Romashkova</span>. <strong>Description:</strong></p>\n<blockquote>\n<p><em>No description.</em></p>\n</blockquote>",
        "id": 89904,
        "sender_full_name": "Notification Bot",
        "timestamp": 1696538668
    },
    {
        "content": "<p>Hi all! Setting up this stream with relevant folks so we have a centralized discussion+planning spot as we're more actively working on developing centralized diagnostics. Feel free to add anybody who's interested!</p>",
        "id": 89906,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1696538752
    },
    {
        "content": "<p>Hi all. I can't make the hackathon today. My only salient update is that Mike &amp; Teagan reached out to Elena and me via email. They are asking whether we have an estimated timeline for the ADF+nbscuid proof-of-concept. I replied that we devised an idea for a minimal example using an ADF notebook run from nbscuid. I think that accurately describes what we discussed, right? And I tried to be noncommittal about the timeline because I wasn't sure how much time we have to do this. Maybe we can figure out who has a few hours over the next month or so to sit and try to get this working. I can try to help, but I'm squeezed for time.</p>",
        "id": 90282,
        "sender_full_name": "Brian Medeiros",
        "timestamp": 1697140644
    },
    {
        "content": "<p>Thanks Brian!  That sounds like a reasonable response to me.  Last I heard we were just waiting on <span class=\"user-mention\" data-user-id=\"277\">@Justin Richling</span> to see if he  could find a simple ADF configuration that he knew ran, and then go from there.  However, I know he is currently being pulled onto other projects so it could still be a little while.</p>\n<p>Also, apologies for not making the hackathon today!  I had an unskippable CCPP standard names meeting that went long.  I should definitely be around for the next hackathon, however.</p>",
        "id": 90288,
        "sender_full_name": "Jesse Nusbaumer",
        "timestamp": 1697147971
    },
    {
        "content": "<p>Update from my side, I have that notebook from Justin with the simple run of ADF and am currently working on getting it running through nbscuid and documenting that so that others can play with it. I'll plan to show that to folks at next week's hackathon</p>",
        "id": 90289,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1697148325
    },
    {
        "content": "<p>Beat me to it, thanks Elena!</p>",
        "id": 90290,
        "sender_full_name": "Justin Richling",
        "timestamp": 1697148351
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Elena Romashkova</span> <a href=\"#narrow/stream/63-CESM-diagnostics/topic/stream.20events/near/90289\">said</a>:</p>\n<blockquote>\n<p>Update from my side, I have that notebook from Justin with the simple run of ADF and am currently working on getting it running through nbscuid and documenting that so that others can play with it. I'll plan to show that to folks at next week's hackathon</p>\n</blockquote>\n<p>If anyone wants to check it out before then, it should be working now here, with some instructions: <a href=\"https://github.com/rmshkv/nbscuid-adf-sandbox/tree/main\">https://github.com/rmshkv/nbscuid-adf-sandbox/tree/main</a></p>",
        "id": 90294,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1697163675
    },
    {
        "content": "<p>Are there any objections to making this stream public? We are looking at using this for more communication regarding CESM diagnostics and it'd be great if people could contribute more easily.</p>",
        "id": 92623,
        "sender_full_name": "Teagan King",
        "timestamp": 1701376364
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Lev Romashkov</span> changed the <a href=\"/help/stream-permissions\">access permissions</a> for this stream from <strong>Private, shared history</strong> to <strong>Public</strong>.</p>",
        "id": 92659,
        "sender_full_name": "Notification Bot",
        "timestamp": 1701382408
    }
]