[
    {
        "content": "<p>Hello,  I'm on jupyterhub on the casper login node and trying to run a script that I have run here before.  When I try to do anything it gives an error \"can't start new thread\".  Googling tells me that there are too many threads running in the python process and it happens if there are resource limitations.  But I haven't really tried to do anything and it even happens if I try to start a dask cluster in an attempt to get more resources.  Can anyone help me?  Thanks!</p>",
        "id": 31321,
        "sender_full_name": "Isla Simpson",
        "timestamp": 1620847524
    },
    {
        "content": "<p>Have you tried using the casper batch node instead?</p>",
        "id": 31322,
        "sender_full_name": "Max Grover",
        "timestamp": 1620847616
    },
    {
        "content": "<p>I wondered about that but I can't figure out how to quit the one I'm running.  How to you totally stop a jupyterhub session when you've set the wallclock limit as 12 hours?  I close down the browser and then open it again and it just brings me back to where I was.  I even killed the job in the queue and it still brought me back to my open session and now I don't see me having any jobs in the queue.  Sorry, I should probably know this by now!</p>",
        "id": 31324,
        "sender_full_name": "Isla Simpson",
        "timestamp": 1620847751
    },
    {
        "content": "<p>oh nevermind.  found it!  let me try.</p>",
        "id": 31325,
        "sender_full_name": "Isla Simpson",
        "timestamp": 1620847778
    },
    {
        "content": "<p>ok, this is working now.  Thanks!</p>",
        "id": 31326,
        "sender_full_name": "Isla Simpson",
        "timestamp": 1620847883
    },
    {
        "content": "<p>For future refernce, under the \"File\" menu there is an option to view the \"Hub control panel.\" This allows you kill your server, or spawn new ones on the same or different platform.</p>",
        "id": 31342,
        "sender_full_name": "Matt Long",
        "timestamp": 1620857240
    },
    {
        "content": "<p>Ah, this is great to know.  Thanks!</p>",
        "id": 31344,
        "sender_full_name": "Isla Simpson",
        "timestamp": 1620858713
    }
]