[
    {
        "content": "<p>We're starting to look at updates for JupyterHub that will be targeted for October. If there are any desired updates / changes / pain points, we'd certainly like to get some feedback. Please let us know.</p>",
        "id": 42805,
        "sender_full_name": "Jared Baker",
        "timestamp": 1631721721
    },
    {
        "content": "<p>If time permits,  could you add the <a href=\"https://github.com/mamba-org/gator\"><code>gator</code></a> jupyterlab extension to the Hub's base environment?</p>",
        "id": 42806,
        "sender_full_name": "Anderson Banihirwe",
        "timestamp": 1631722573
    },
    {
        "content": "<p>If it's not already there, including <code>fsspec</code> or similar packages for connecting to s3 endpoints would be nice.</p>",
        "id": 42828,
        "sender_full_name": "Brian Bonnlander",
        "timestamp": 1631727278
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"9\">@Brian Bonnlander</span>:  Do you mean in the base JupyterLab kernels?  You can always install <code>fsspec</code> yourself in your own Conda environments, right?</p>",
        "id": 42829,
        "sender_full_name": "Kevin Paul",
        "timestamp": 1631727342
    },
    {
        "content": "<p>Absolutely correct; I manage my own conda environments on JupyterHub, but other users cannot run the notebooks I create unless they are good at managing conda environments, and this might create a pain point for them.</p>",
        "id": 42830,
        "sender_full_name": "Brian Bonnlander",
        "timestamp": 1631727492
    },
    {
        "content": "<p><span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> I think that might be a good discussion to have around what the \"base environments\" should contain.</p>",
        "id": 42832,
        "sender_full_name": "Kevin Paul",
        "timestamp": 1631727543
    },
    {
        "content": "<p>If you consider adding jupyterlab extensions, could you have a look at <a href=\"https://github.com/ryantam626/jupyterlab_sublime\">https://github.com/ryantam626/jupyterlab_sublime</a>?<br>\nUntil jupyterlab implements additional key maps for editing notebooks, lab extensions are the only workaround.</p>\n<p>I do realise that some key bindings might change the default behaviour, which could be annoying for many users. Is there a way to make an extension like this one available to users, but only if they choose to use it and not by default?</p>",
        "id": 42879,
        "sender_full_name": "Sebastian Milinski",
        "timestamp": 1631745795
    }
]