[
    {
        "content": "<p>From Kasia Tokarska:</p>\n<p>The workshop \"Tackling Climate Change with Machine Learning\" at the International Conference on Machine Learning (ICML) 2021 will be held virtually on Friday, July 23rd, from 8:00-19:00 ET / 12:00-23:00 UTC.</p>\n<p>Highlights include:<br>\n    • Keynote talks from: Kate Marvel (NASA), Shakir Mohamed (DeepMind), Solomon Assefa (IBM Research Africa), and Draguna Vrabie (PNNL)<br>\n    • 89 research posters from a wide array of fields at the intersection of climate change and ML, 13 of which are highlighted for spotlight talks.<br>\n    • Two expert panel discussions:<br>\n(i) Designing projects and finding collaborators in climate change and ML<br>\n(ii) Monitoring and mitigation of emissions in line with Paris Agreement targets<br>\n    • Interactive poster sessions (via Gather.town) for discussions and networking with authors, speakers, organizers, and other participants. </p>\n<p>While the entire workshop will be live-streamed for free, we hope you will register to get the full benefits of the workshop (including the ability to attend poster sessions and ask questions during the live Q&amp;A). General registration is USD 100, dropping to USD 25 for students. (This registration also grants full access to the rest of ICML 2021, which is one of the world’s largest machine learning research conferences.)</p>\n<p>Climate Change AI can offer a limited number of registration grants to those who may require financial assistance to cover the cost of the ICML 2021 registration fee. Please apply here if you are interested: <a href=\"https://forms.gle/xxcg5nzvYqkZ7TGK6\" target=\"_blank\" title=\"https://forms.gle/xxcg5nzvYqkZ7TGK6\">https://forms.gle/xxcg5nzvYqkZ7TGK6</a></p>\n<p>For more information, a full event schedule, and info about the free live-stream, please visit the workshop page at: <a href=\"https://www.climatechange.ai/events/icml2021\" target=\"_blank\" title=\"https://www.climatechange.ai/events/icml2021\">https://www.climatechange.ai/events/icml2021</a></p>\n<p>Feel free to reach out to us for more information or with any questions.</p>\n<p>We hope to see you virtually on July 23rd!</p>\n<p>Best wishes,</p>\n<p>Kasia</p>\n<p>-on behalf of the organisers:</p>\n<p>Hari Prasanna Das (UC Berkeley), Katarzyna (Kasia) Tokarska (ETH Zurich), Maria João Sousa (IST, ULisboa), Meareg Hailemariam (DAUST), David Rolnick (Mila, McGill), Xiaoxiang Zhu (TU Munich), Yoshua Bengio (Mila, UdeM).</p>",
        "id": 37990,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1626733159
    }
]