[
    {
        "content": "<p><strong><em>Position Summary</em></strong><br>\nThe recently awarded 2021 National Science Foundation Science and Technology Center Learning the Earth with Artificial Intelligence and Physics (LEAP, <a href=\"https://leap.columbia.edu/\">https://leap.columbia.edu/</a>) aims to develop next-generation climate models by developing and applying modern data science algorithms. LEAP is a joint effort between Columbia University, the University of California Irvine, New York University, The University of Minnesota, Teachers College, the National Center for Academic Research (NCAR), and the NASA Goddard Institute for Space Studies (GISS).  LEAP’s primary research objective is to improve near-term climate projections by merging Earth System modeling with new methods in machine learning.</p>\n<p>The Integration Software Engineer (open rank) will work with a team of scientists from the LEAP center and NCAR and with NCAR software engineers to support the development of machine learning algorithms and their implementation and testing in the Community Earth System Model (CESM).</p>\n<p>Though this position will be hired through the LEAP project by Columbia University, it is expected that the applicant will work within the CESM Software Engineering Group (CSEG) in the Climate and Global Dynamics Laboratory (CGD), which is part of the National Center for Atmospheric Research (NCAR), located  in Boulder, Colorado.</p>\n<p><strong><em>Responsibilities</em></strong></p>\n<ul>\n<li>Provide software engineering support to aid implementation of new machine-learning based science, maintenance of testing frameworks, and development of new machine learning infrastructure in the CESM.</li>\n<li>Contribute code changes and upgrades in support of CESM and LEAP community development activities and science goals.</li>\n<li>Develop, implement, test, analyze, and document the integration of machine learning methods in the CESM.</li>\n<li>Write code and assist in the design of system software for these systems.</li>\n</ul>\n<p><strong><em>Minimum Qualifications</em></strong></p>\n<ul>\n<li>Bachelor’s degree in computer science or physical science or its equivalent required.</li>\n<li>A minimum of 4-6 years of related experience required in software development or climate / Earth System Modeling experience. </li>\n<li>Some experience with machine learning.</li>\n<li>Excellent interpersonal and oral and written communication skills required.</li>\n<li>Must be skilled at developing strong relationships with both internal and external partners.</li>\n</ul>\n<p><strong><em>Preferred Qualifications</em></strong></p>\n<ul>\n<li>Demonstrated experience in supercomputing programming environments including MPI, OpenMP, NetCDF.</li>\n<li>Demonstrated ability to debug complex software running on hundreds to thousands of processors.</li>\n<li>Demonstrated skill in the use of git and GitHub for source code management.</li>\n<li>Advanced knowledge of modern Fortran, Python, and shell.</li>\n<li>Advanced ability to work in a UNIX environment.</li>\n<li>Coursework or experience in undergraduate-level physics or environmental sciences.</li>\n<li>Facility with calculus, differential equations, linear algebra, machine learning, and statistics.</li>\n<li>Experience in plotting and visualizing scientific data, or experience with graphical analysis tools.</li>\n<li>Experience in numerical (weather/climate) model development and operation.</li>\n<li>Proven ability to plan as well as coordinate development work and meet deliverable deadlines.</li>\n<li>Ability to convey advanced technical concepts to others, including aptitude for public speaking to scientific, technical, customer/sponsor, and public audiences.</li>\n<li>Excellent oral and written communication skills.</li>\n<li>Demonstrated ability to work as part of a diverse, collaborative, multi-institution team.</li>\n</ul>\n<p>To apply, visit <a href=\"https://opportunities.columbia.edu/en-us/job/525685/integration-engineer\">https://opportunities.columbia.edu/en-us/job/525685/integration-engineer#</a></p>",
        "id": 55135,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1652908247
    }
]