[
    {
        "content": "<p><a href=\"https://leap.columbia.edu/\">The Center for Learning the Earth with Artificial Intelligence and Physics (LEAP)</a> at Columbia University is excited to announce its Momentum Bootcamp on Climate Data Science. This three-day, immersive, hands-on workshop is designed by LEAP researchers as part of LEAP’s education programming to foster convergence of climate science and data science, to vertically integrate research and education, and to forge a LEAP research and learning community including K-12 teachers, undergraduates, graduate students, postdocs, faculty, and other stakeholders. <a href=\"https://forms.gle/gmzar29d4CDZSFvPA\">Click here</a> for a program description and tentative schedule.</p>\n<p>Date: May 25-27, 2022<br>\nSchedule: 6pm-8pm (May 25), 8am-8pm (May 26), 8am-4pm (May 27)<br>\nVenue: <a href=\"https://www.edithmacy.com/\">Edith Macy Center</a> (550 Chappaqua Road, Briarcliff Manor, NY 10510)</p>\n<p>This bootcamp is open to:<br>\n● Faculty members and research scientists from LEAP institutions (Columbia, NYU, University of Minnesota, and University of California at Irvine)<br>\n● Graduate students and postdocs from LEAP institutions<br>\n● Research scientists from LEAP partner organizations (including NCAR)<br>\n● LEAP Summer 2022 REU participants (students and research group members)<br>\n● Significant Opportunities in Atmospheric Research and Science (SOARS) Protégés<br>\n● NYC Department of Education high school teachers</p>\n<p>The bootcamp will introduce climate data science to participants through a variety of activities including lectures, labs, and team hacking, which aim to prepare participants for machine learning-enabled climate research and more advanced and intensive research-oriented workshops (<a href=\"https://www.ai2es.org/\">AI4ES at NCAR</a> and <a href=\"https://www2.cisl.ucar.edu/events/tai4es-2022-summer-school\">TAI4ES summer school</a>). Contact <a href=\"mailto:leap@columbia.edu\">leap@columbia.edu</a> with questions.</p>\n<p>Seats are limited. <a href=\"https://forms.gle/gmzar29d4CDZSFvPA\">Apply here</a>. The deadline for applications is April 15, 2022.</p>",
        "id": 53312,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1649271462
    }
]