[
    {
        "content": "<p>ESIP Cloud Computing Cluster Session June 26: Dask and Coiled with Matt Rocklin of <a href=\"http://Coiled.io\">Coiled.io</a><br>\nDetails here: <a href=\"https://discourse.pangeo.io/t/esip-cloud-computing-cluster-session-june-26-dask-and-coiled-with-matt-rocklin-of-coiled-io/3488\">https://discourse.pangeo.io/t/esip-cloud-computing-cluster-session-june-26-dask-and-coiled-with-matt-rocklin-of-coiled-io/3488</a></p>",
        "id": 82363,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1686083363
    },
    {
        "content": "<p>Happening now!</p>\n<p>Join Zoom Meeting<br>\n<a href=\"https://esipfed-org.zoom.us/j/82186805451?pwd=SzNJbGloZjJHOTlFeGo2aWZjSEhGUT09\">https://esipfed-org.zoom.us/j/82186805451?pwd=SzNJbGloZjJHOTlFeGo2aWZjSEhGUT09</a></p>\n<p>Meeting ID: 821 8680 5451<br>\nPasscode: ESIP23</p>\n<blockquote>\n<p>Dask makes it easy to parallelize Python code, either your own custom code, or through integrations with common libraries (pandas, numpy, xgboost, xarray, etc.). While Dask is used in a broad set of applications, in this talk we’ll mostly focus on applications in the Pangeo ecosystem, a set of tools (Xarray, Dask, Zarr, and others) that make it easy to perform earth science applications at scale.</p>\n</blockquote>\n<blockquote>\n<p>Coiled makes it easy to manage cloud infrastructure. Coiled came out of many experiments running Dask clusters on cloud infrastructure. We found that users had trouble managing software package versions, cloud credentials, managing idle clusters, managing users, and predicting and constraining costs. The Coiled platform was developed as a centralized service to deploy Dask clusters in a way that addressed these issues.</p>\n</blockquote>\n<blockquote>\n<p>We hope to show that, with these two technologies, we’ve found a good way to enable the vast majority of Python users to run their analyses at scale.</p>\n</blockquote>",
        "id": 83854,
        "sender_full_name": "Deepak Cherian",
        "timestamp": 1687798998
    }
]