[
    {
        "content": "<p>Hello everyone,<br>\nESDS is organizing the 2024 Earth System Data Science Annual Event that will take place January 18-19th, and we want your input to ensure that the event is as useful to you as possible! What topics are you interested in? What event format is most appealing? We would really appreciate if you could fill out this <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScltShpXxXs1SN89O5ieosbd0IOqXIWnazi_NDDD0R8KROeqg/viewform\">3-minute survey</a> to share your thoughts!<br>\nThank you,<br>\nTeagan, on behalf of ESDS</p>",
        "id": 89874,
        "sender_full_name": "Teagan King",
        "timestamp": 1696533555
    },
    {
        "content": "<p>Hi everyone! </p>\n<p>Registration is open for the 2024 Earth System Data Science (ESDS) Annual Event (January 18 &amp; 19, 2024)! </p>\n<p>The event will cover tutorials on Python, Git, the NCAR Environment, JupyterHub, Xarray, Dask, and Interactive unstructured grids visualization with UXarray. There will also be breakout groups for collaborative work and discussions on topics of interest to attendees.</p>\n<p>Please visit the <a href=\"https://ncar.github.io/esds/posts/2023/esds-annual-event/\">event website</a> for more information and to register by January 5, 2024.</p>\n<p>Katelyn (on behalf of the ESDS Events Working Group)</p>",
        "id": 93627,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1702920725
    },
    {
        "content": "<p>Hey everyone, Registration for the <a href=\"https://ncar.github.io/esds/posts/2023/esds-annual-event/\">2024 Earth System Data Science Annual Event on January 18 &amp; 19</a> closes this Friday! Sign up soon if you would like to attend the event! There will be tutorials on Python, Git, NCAR Environment, JupyterHub, Xarray, Dask, and Interactive unstructured grid visualization with UXarray, as well as breakout groups for collaborative work.</p>",
        "id": 93871,
        "sender_full_name": "Teagan King",
        "timestamp": 1704323705
    }
]