[
    {
        "content": "<p>Dear staff,</p>\n<p>Discover the fundamentals of machine learning (ML) with our “<strong>Introduction to Machine Learning</strong>” course, taking place i<strong>n person at the Mesa Lab on Tuesday November 7th, and Wednesday November 8th, 2023 in the Library</strong>. This is the introductory course in a 2-part machine learning series hosted by NCAR EdEC (with an intermediate course to follow in 2024*). </p>\n<p>The introductory course will focus on applied usage of ML in Earth system science with incorporating fundamental theory. It will primarily focus on the utilization of the scikit-learn framework  (non-neural network modeling approach). However, the principles covered will extend to future applications, including complex geospatial and deep learning workflows. Topics covered will include supervised and unsupervised ML for various problems and datasets, addressing data-related challenges, pre-processing techniques, feature selection and engineering, as well as evaluation methodologies. </p>\n<p>The intermediate course will cover more advanced ML techniques such as semi-supervised learning, convolutional and recurrent neural networks, U-Nets, eXplainable Artificial Intelligence (XAI), and other useful ML software. A more detailed agenda will be provided before the start of the course. </p>\n<p>Proficiency in Python is a prerequisite for participation. </p>\n<p>While this Machine Learning course is open to all NCAR staff, priority will be granted to early-career scientists and engineers (individuals who obtained their last degree within the last 12 years). The deadline for priority acceptance is October 15; after that, the remaining spots will be filled on a first-come, first-served basis. The course is being limited to 30 participants.</p>\n<p><strong>Please sign up for the introductory course using the link below:</strong><br>\n<a href=\"https://forms.gle/xdEP1VzyXK6X24E46\">https://forms.gle/xdEP1VzyXK6X24E46</a></p>\n<ul>\n<li>a separate sign-up sheet will be provided for the intermediate course later</li>\n</ul>\n<p>Please let Charlie Becker (<a href=\"mailto:cbecker@ucar.edu\">cbecker@ucar.edu</a>) or Thomas Martin (<a href=\"mailto:tmartin@ucar.edu\">tmartin@ucar.edu</a>) know if you have any questions about the course.</p>\n<p>Thanks</p>\n<p><strong>MILES group</strong>: Charlie Becker, Thomas Martin, Kristen Mayer, Will Chapman, John Schreck <br>\n<strong>EdEC-ECD</strong>: Gunter Leguy, Cecile Hannay</p>",
        "id": 89671,
        "sender_full_name": "Thomas Martin",
        "timestamp": 1696355311
    }
]