[
    {
        "content": "<p>Dear Zulip Users,</p>\n<p>The NWSC Datacenter (which is where the Zulip server is located) will be <strong>completely down from 7/26 to 7/28</strong> for maintenance to the power infrastructure.  During that time, this Zulip service will also be unavailable.</p>\n<p>I will try to keep you all informed and reminded as the date approaches.</p>\n<p>-- Kevin</p>",
        "id": 33390,
        "sender_full_name": "Kevin Paul",
        "timestamp": 1622746432
    },
    {
        "content": "<p>Just a reminder to everyone that the Zulip server will be going down next week from 7/26 to 7/28.</p>",
        "id": 37940,
        "sender_full_name": "Kevin Paul",
        "timestamp": 1626722945
    },
    {
        "content": "<p>Just a reminder to everyone that this Zulip service will be unavailable during the downtime from Monday (7/26) through Wednesday (7/28).</p>",
        "id": 38574,
        "sender_full_name": "Kevin Paul",
        "timestamp": 1627080453
    },
    {
        "content": "<p>Welcome back from our downtime!  Some of you will notice that we are now upgraded to Zulip 4.5!  Yay!  That went smoothly.</p>\n<p>Ping me if you have questions or problems.</p>",
        "id": 38594,
        "sender_full_name": "Kevin Paul",
        "timestamp": 1627595871
    },
    {
        "content": "<p>Hello everyone. We plan to upgrade the Zulip server on Monday Feb 5th. We will start this upgrade at 6:30am mountain time and reserver4 hours for the work due to amount work involved. We may get done sooner barring any roadblocks. Please let us know if this date has any conflicts.  There service will be available multiple times so please avoid using Zulip until a completion message is sent.</p>",
        "id": 94705,
        "sender_full_name": "Nick Wehrheim",
        "timestamp": 1705689207
    },
    {
        "content": "<p>The upgrade is complete and we are now running version 8.1 of the software. Please let us know via <a href=\"mailto:help@ucar.edu\">help@ucar.edu</a> if there are any issues and thank you.</p>",
        "id": 95446,
        "sender_full_name": "Nick Wehrheim",
        "timestamp": 1707144352
    },
    {
        "content": "<p>On Monday, August 5th the Zulip service and server will be upgraded and patched to the latest versions of software. This upgrade process will start at 9am MDT. We hope the new software upgrades will address the current broken search functionality.</p>",
        "id": 103524,
        "sender_full_name": "Nick Wehrheim",
        "timestamp": 1722536210
    },
    {
        "content": "<p>The Zulip server and service have been upgraded. The upgrades were successful, however the efforts to fix the search functionality were unsuccessful. We're looking into migrating the service to a new server and OS in the near future to try to address this problem again. This will involve a number  of meticulous steps including migrating the database. and require a bit more coordination. A message will be sent when a solidified plan is determined.</p>",
        "id": 103604,
        "sender_full_name": "Nick Wehrheim",
        "timestamp": 1722874343
    },
    {
        "content": "<p>As long as we can keep this critical resource! Thanks for your efforts.</p>",
        "id": 103652,
        "sender_full_name": "Holly Olivarez",
        "timestamp": 1722904141
    }
]