[
    {
        "content": "<p>Hi all,</p>\n<p>The <a href=\"https://ncar.github.io/esds/about/#events-working-group\">ESDS Events Working Group</a> is hosting a follow on workshop \"<a href=\"https://ncar.github.io/esds/posts/2024/automation-github-workshop/\">From Jupyter Notebook to Web Server: Automating Container Deployments with GitHub Actions</a>\" led by Nick Cote, NSF NCAR/CISL, on August 8th, from 9a - noon MDT for NSF NCAR and UCAR staff.  This workshop builds upon the earlier workshop, \"<a href=\"https://ncar.github.io/esds/posts/2024/containerize-visualizations-event/\">From Jupyter Notebook to Web Server: Containerizing Interactive Visualizations</a>.\"  However, prior attendance is not a prerequisite for attendance and <a href=\"https://youtu.be/Bhj2KdZcK70\">a recording is available here</a>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Bhj2KdZcK70\" href=\"https://youtu.be/Bhj2KdZcK70\"><img src=\"/external_content/909c4475ceacccfe01a54872202e367466d84a1f/68747470733a2f2f692e7974696d672e636f6d2f76692f42686a324b645a634b37302f64656661756c742e6a7067\"></a></div><p>Participants will be guided through automation techniques available via GitHub for building container images and updating on-premise cloud applications. Attendees will develop a GitHub Action workflow to build a container image and push it to Docker Hub. The workshop will also cover creating a Helm chart, an application configuration, that can be used to deploy to the On-premise cloud pilot. The session further delves into using GitHub Actions to update the Helm chart with new build information and how it can enable an automation strategy known as GitOps. Here is <a href=\"https://github.com/NicholasCote/nbviz-to-container\">a link to the code repository</a> containing a notebook that walks through the workshop content.</p>\n<p>The workshop will be held at the NSF NCAR Mesa Lab and virtually. You can find more information and a link to the registration page <a href=\"https://ncar.github.io/esds/posts/2024/automation-github-workshop/\">on this ESDS blog post</a>.</p>\n<p>Hope to see you there!  </p>\n<p>Katelyn, on behalf of the ESDS Events Working Group</p>",
        "id": 101715,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1719947113
    },
    {
        "content": "<p>Hi all,<br>\nRegistration closes this Sunday, August 4th, for Nick Cote's workshop \"<a href=\"https://ncar.github.io/esds/posts/2024/automation-github-workshop/\">From Jupyter Notebook to Web Server: Automating Container Deployments with GitHub Actions</a>\". The workshop will be held on August 8th, 9am-12pm, at the Mesa Lab and virtually.<br>\nHope to see you there!<br>\nTeagan &amp; ESDS Events Working Group</p>",
        "id": 103221,
        "sender_full_name": "Teagan King",
        "timestamp": 1722264452
    }
]