[
    {
        "content": "<p>Cecilia Bitz just sent me <a href=\"/user_uploads/2/c0/5ZMv7Upy9Qea7gILCwAkvZRN/PaulingBushukBitz_2021_Volcanoes.pdf\" target=\"_blank\" title=\"PaulingBushukBitz_2021_Volcanoes.pdf\">this paper</a>.</p>\n<p><strong>Robust Inter-Hemispheric Asymmetry in the Response to Symmetric Volcanic Forcing in Model Large Ensembles</strong><br>\nThe climate response to volcanic eruptions in the twentieth century is difficult to separate<br>\nfrom the influence of anthropogenic greenhouse gas forcing and internal variability. Here, we make use<br>\nof recently available large ensembles of Earth-system model simulations to better understand the forced<br>\nclimate response to contemporary volcanic eruptions. While the Pinatubo eruption in June 1991 resulted<br>\nin approximately symmetric forcing between the Northern and Southern Hemispheres, the ensemblemean<br>\nsimulated temperature and sea ice responses it produces are asymmetric. The strongest cooling and<br>\nsea ice expansion occur in the Arctic, while the responses in the Antarctic are weak. The damped highlatitude<br>\nSouthern Hemisphere response to volcanic forcing is analogous to the fast response to increased<br>\ngreenhouse gas concentrations, despite the differing physical nature of the forcing. We find that Arctic<br>\ncooling in response to a Pinatubo-scale eruption may not occur due to the high internal variability in that<br>\nregion</p>",
        "id": 35048,
        "sender_full_name": "Matt Long",
        "timestamp": 1624291450
    },
    {
        "content": "<p>Very interesting!</p>",
        "id": 35179,
        "sender_full_name": "Yassir Eddebbar",
        "timestamp": 1624346177
    },
    {
        "content": "<p>Just a quick check here with the ~ 11 ensemble members (can't access 18+ member_ids), but seems to be the case for the no Pinatubo case as well: <a href=\"/user_uploads/2/80/2HmmTa1klmDn8PycdnQFhvZ0/Figure_no_pinatubo.png\" target=\"_blank\" title=\"Figure_no_pinatubo.png\">Figure_no_pinatubo.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/2/80/2HmmTa1klmDn8PycdnQFhvZ0/Figure_no_pinatubo.png\" target=\"_blank\" title=\"Figure_no_pinatubo.png\"><img src=\"/user_uploads/2/80/2HmmTa1klmDn8PycdnQFhvZ0/Figure_no_pinatubo.png\"></a></div>",
        "id": 35476,
        "sender_full_name": "Yassir Eddebbar",
        "timestamp": 1624479210
    }
]