[
    {
        "content": "<p>Join the GeoCAT team today (Monday, March 21) at 2pm MDT for a team update. The team is excited to update the ESDS community on their on-going efforts. In the past 11 months since the last GeoCAT update, the GeoCAT team has continued their efforts in bringing NCL into the Python ecosystem, expanded the GeoCAT-examples plotting gallery to include interactive plotting notebooks, and began working on the recently funded Project Raijin, which aims to address the geoscience community need for tools that enable standard data analysis on unstructured grid data through the development of the Uxarray software package. During this presentation, the team will discuss improvements and future work to the existing GeoCAT software stack, new and upcoming developments to Uxarray, and announce the many different ways the ESDS community can get involved with our projects. </p>\n<p>See more details on Sundog: <a href=\"https://sundog.ucar.edu/Interact/Pages/Content/Document.aspx?id=5520\">https://sundog.ucar.edu/Interact/Pages/Content/Document.aspx?id=5520</a></p>",
        "id": 52457,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1647882692
    },
    {
        "content": "<p>@all, our speaker had something come up and cannot make it today. We hope to reschedule, but we're canceling the ESDS Forum today. Note that you can add the ESDS calendar to your Google Calendar <a href=\"https://ncar.github.io/esds/calendar/\">here</a></p>",
        "id": 53136,
        "sender_full_name": "Matt Long",
        "timestamp": 1649083820
    },
    {
        "content": "<p>Please consider joining the ESDS Forum today (Monday, April 18) at 2pm MT for a discussion led by <span class=\"user-mention\" data-user-id=\"19\">@John Clyne</span> on Establishing a Data Analysis Computing Resources User Group.</p>\n<p>The Earth System Data Sciences (ESDS) community will hold an open discussion at their bi-weekly forum to help explore interest in establishing a user group focused on computing resources and support for data analysis. The aims of this user group include helping promote effective communication between CISL and the scientific community; sharing information about experiences with CISL computing and storage facilities; suggesting new research and technology directions to CISL; voicing concerns; and helping keep the scientific community informed about CISL plans. All are welcome to join the discussion and contribute ideas for the future of this data analysis focused user group.</p>\n<p>See more details on Sundog: <a href=\"https://sundog.ucar.edu/Interact/Pages/Content/Document.aspx?id=5659\">https://sundog.ucar.edu/Interact/Pages/Content/Document.aspx?id=5659</a></p>",
        "id": 53708,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1650290655
    },
    {
        "content": "<p>Join us on Monday May 2, 2022 for a talk on the Python API for VAPOR by \"Stas\" Jaroszynski.</p>\n<p><strong>Abstract</strong>: VAPOR is a desktop application that provides interactive visualization of geoscience data. Recently, a Python API has been added to VAPOR, allowing the visualization of 3D (and 2D) data from within the Python environment, including Jupyter Notebooks. In addition to many common earth science data formats, VAPOR’s Python API allows directly rendering Numpy arrays and Xarray DataArrays. This presentation will give an overview and demonstration of this exciting new capability.</p>",
        "id": 54386,
        "sender_full_name": "Deepak Cherian",
        "timestamp": 1651160357
    },
    {
        "content": "<p>@all, consider joining us Monday, May 16 at 2pm MDT for the following discussion led by <span class=\"user-mention\" data-user-id=\"12\">@Julia Kent</span> .</p>\n<p><strong>Title: An Overview of Project Pythia</strong></p>\n<p>Julia will provide an overview of <a href=\"https://projectpythia.org\">Project Pythia</a>, which is a home for Python-centered learning resources that are open-source, community-owned, and geoscience-focused. These resources include:</p>\n<ul>\n<li>The Foundations Book - a comprehensive set of tutorials covering the foundational skills everyone needs to get started with computing in the open-source Python ecosystem,</li>\n<li>The Resource Gallery - a curated and filterable list of educational resources for learning Python from across the web,</li>\n<li>The Webinar Tutorial Series - hour-long, instructor-led interactive tutorials,</li>\n<li>Pythia Data Collection - free, public domain geoscience data sets that you can practice your Python skills with, and</li>\n<li>Cookbooks - COMING SOON, collections of more advanced and domain-specific example workflows that build on top of Pythia Foundations.</li>\n</ul>\n<p>Julia will help you navigate the site so that you are best equipped to use this resource to help improve your Python coding skills.</p>\n<p>Join the Zoom Meeting here:<br>\n<a href=\"https://ucar-edu.zoom.us/j/97931903544\">https://ucar-edu.zoom.us/j/97931903544</a><br>\nPasscode: HgNd92zi</p>",
        "id": 54696,
        "sender_full_name": "Matt Long",
        "timestamp": 1652201757
    },
    {
        "content": "<p>Please consider joining us on Monday, June 27 at 2pm MDT for the following discussions. </p>\n<p>(1) Hauke Schulz (MPI) will present on <a href=\"https://xbitinfo.readthedocs.io/en/latest/\">xbitinfo</a> (a data compression package) that illustrates how to call out to Julia libraries from Python analytics or post-processing code.</p>\n<p>(2) Ken Cote and Nick Wehrheim (NCAR) will present and solicit feedback on CISL's ongoing JupyterHub development efforts.</p>\n<p>Join Zoom Meeting<br>\n<a href=\"https://ucar-edu.zoom.us/j/97931903544\">https://ucar-edu.zoom.us/j/97931903544</a></p>\n<p>Meeting ID: 979 3190 3544<br>\nPasscode: HgNd92zi</p>",
        "id": 57031,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1655997677
    },
    {
        "content": "<p>Please consider joining us on Monday July 11 at 2pm MDT for the following discussion.</p>\n<p>CISL, in conjunction with ESDS, is establishing an Analysis Workflow Special Interest Group (AWSIG). The AWSIG will provide a communication forum for the exchange of ideas and experiences related to the operational aspects of CISL supported analysis resources and services (e.g. Casper,  JupyterHub, GLADE, VirtualGL, etc.). This working group will complement the more modeling/simulation focused NCAR HPC User Group (NHUG).</p>\n<p>We will kick off the first AWSIG meeting at the next ESDS Forum with a brief introduction to the SIG, and the following talk from CISL’s Consulting Group:</p>\n<p><strong><em>Supporting the Analysis Software Ecosystem</em></strong></p>\n<p>CISL began offering a Conda package manager module on our HPC systems last year. Simultaneously, we migrated our NCAR Python Library (NPL) environment to a Conda-based monthly release, with access both from JupyterHub and the command line. Moving forward, JupyterHub kernel curation and delivery will be an area of focus; we are planning to adopt a bi-yearly update cadence for most analysis software, with uniform access both in the Hub and command-line. In this presentation, we will describe these plans, solicit feedback and suggestions, and also explore mid- and long-term priorities for supporting analysis software libraries.</p>\n<p>Join Zoom Meeting<br>\n<a href=\"https://ucar-edu.zoom.us/j/97931903544\">https://ucar-edu.zoom.us/j/97931903544</a></p>\n<p>Meeting ID: 979 3190 3544<br>\nPasscode: HgNd92zi</p>",
        "id": 57954,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1657029629
    },
    {
        "content": "<p>Hi all! Just another reminder before the weekend.</p>\n<p>Please consider joining us for the first meeting of the new Analysis Workflow Special Interest Group (AWSIG) at 2 p.m. MDT this Monday, July 11 during the usual ESDS Forum! This group will provide a communication forum for the exchange of ideas and experiences related to the operational aspects of CISL-supported analysis resources and services, including Casper, JupyterHub, GLADE, VirtualGL, and others. The group will complement the more modeling- and simulation-focused NCAR HPC User Group.</p>\n<p>Also during the upcoming ESDS forum, the CISL Consulting Group will be giving a talk on <em>Supporting the Analysis Software Ecosystem</em> to discuss and solicit feedback on plans for updating analysis software packages, providing uniform access via both JupyterHub and command line, and on mid- and long-term priorities for supporting analysis software libraries.</p>\n<p>ESDS Forum, Monday, July 11th at 2pm MDT<br>\nZoom link to attend: <a href=\"https://ucar-edu.zoom.us/j/97931903544\">https://ucar-edu.zoom.us/j/97931903544</a><br>\nMeeting ID: 979 3190 3544<br>\nPasscode: HgNd92zi</p>",
        "id": 58349,
        "sender_full_name": "Heather Craker",
        "timestamp": 1657302569
    },
    {
        "content": "<p>Also, if you are interested in presenting a \"Work In Progress\" (WIP) talk at future ESDS Forums, be sure to sign up on <a href=\"https://docs.google.com/spreadsheets/d/1Tuv5vwGbjSKdJD5KLT0Zow8WCY0_zt35tTI6EIRGOk4/edit?usp=sharing\">this spreadsheet</a>. A WIP talk is a great opportunity for discussing on going work, requesting feedback, practicing workflow demos, giving overviews of additions to packages, and more!</p>",
        "id": 58351,
        "sender_full_name": "Heather Craker",
        "timestamp": 1657302743
    },
    {
        "content": "<p>All, <br>\nThe ESDS Forum will be on pause for the remainder of the Summer. We'll resume with renewed force after Labor Day.</p>",
        "id": 59179,
        "sender_full_name": "Matt Long",
        "timestamp": 1658179274
    },
    {
        "content": "<p>Dear ESDS, <br>\nWe're restarting the ESDS Forum for the Fall!</p>\n<p>Please consider joining our first session on Monday, September 19 at 2p MDT for the following discussions led by CISL's Analysis Workflow Special Interest Group (AWSIG):</p>\n<p>(1) Brian Vanderwende: Dask usage &amp; pain points: request for information: </p>\n<ul>\n<li>Seeking an open discussion on Dask usage in the analysis community, to aid in tutorial planning</li>\n</ul>\n<p>(2) Ben Kirk: Maximizing Casper Throughput: observations, tips, &amp; trick</p>\n<ul>\n<li>Balancing memory requests vs requirements</li>\n<li>Using local storage</li>\n</ul>\n<p>Join Zoom Meeting<br>\n<a href=\"https://ucar-edu.zoom.us/j/97931903544\">https://ucar-edu.zoom.us/j/97931903544</a></p>\n<p>Meeting ID: 979 3190 3544<br>\nPasscode: HgNd92zi</p>",
        "id": 64166,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1663270888
    },
    {
        "content": "<p>I'd like to request the following as a topic for a future ESDS forum (this isn't something I know how to do, but it's something I'm interested in learning how to do):  converting a vetted dask-enabled notebook into a job script that uses dask-mpi.</p>",
        "id": 64703,
        "sender_full_name": "Stephen Yeager",
        "timestamp": 1663864032
    },
    {
        "content": "<p>I'll make sure that gets in the discussion notes for the next forum. Thanks for the suggestion!</p>",
        "id": 64704,
        "sender_full_name": "Heather Craker",
        "timestamp": 1663864307
    },
    {
        "content": "<p>Hi all,<br>\nThis Monday at 2pm will be the first <em>hybrid</em> ESDS forum! As a reminder, it will be held in the Chapman Room at the Mesa Lab and online. There has been a change to the virtual component. It will be on Google Meet, not Zoom, and the link is below.</p>\n<p>This forum will be a little different, as we will start by having impromptu stand-up talks. If you have something you want to share that doesn't need a full presentation, this is the perfect format for it! It can be a quick update about a prior presentation, sharing a software package you've found, or posing a question that may make a good future full-length presentation.</p>\n<p>Here are the links to <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit?usp=sharing\">this week's agenda</a> and the <a href=\"https://meet.google.com/uya-vqhi-twg\">Google meet</a>.</p>\n<p>Hope to see you there!</p>",
        "id": 65212,
        "sender_full_name": "Heather Craker",
        "timestamp": 1664559426
    },
    {
        "content": "<p>What room number is the Chapman Room?</p>",
        "id": 65294,
        "sender_full_name": "Thomas Martin",
        "timestamp": 1664825483
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"313\">Thomas Martin</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/65294\">said</a>:</p>\n<blockquote>\n<p>What room number is the Chapman Room?</p>\n</blockquote>\n<p>ML-245</p>",
        "id": 65297,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1664825523
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 65303,
        "sender_full_name": "Thomas Martin",
        "timestamp": 1664825634
    },
    {
        "content": "<p>Good morning everyone! Next Monday, October 17th is the next ESDS Forum, and we are looking for one or two people to present. The presentations do not need to be about finished work nor do they need to be polished. We actually encourage presentations about current data science challenges that you may be facing, about new packages and tools you've found, or presentations showing a demo of something you've been working on. </p>\n<p>If you or someone you know is interested in presenting, here is the <a href=\"https://docs.google.com/spreadsheets/d/1Tuv5vwGbjSKdJD5KLT0Zow8WCY0_zt35tTI6EIRGOk4/edit?usp=sharing\">sign up sheet</a>!</p>",
        "id": 65971,
        "sender_full_name": "Heather Craker",
        "timestamp": 1665501553
    },
    {
        "content": "<p>Hi all! We have one more forum this year this coming Monday, Dec 12th. With AMS coming up, we highly encourage community members to use this forum to practice their presentations. We still have slots available. Please <a href=\"https://docs.google.com/spreadsheets/d/1Tuv5vwGbjSKdJD5KLT0Zow8WCY0_zt35tTI6EIRGOk4/edit#gid=0\">sign up</a> if you are interested in presenting!</p>",
        "id": 69539,
        "sender_full_name": "Heather Craker",
        "timestamp": 1670353172
    },
    {
        "content": "<p>Hi all! Today is the last forum of the year. Janine Aquino will be practicing her AMS presentation \"An Updated Python Based Software Suite to Control and Monitor the NCAR Microwave Temperature Profiler as a roadmap for software development best practices in support of FAIR Open Data and Software\". Come check it out today at 2pm MT in either the Chapman room or online at <a href=\"http://meet.google.com/uya-vqhi-twg\">meet.google.com/uya-vqhi-twg</a></p>",
        "id": 69993,
        "sender_full_name": "Heather Craker",
        "timestamp": 1670868236
    },
    {
        "content": "<p>Hi all, are the forums continuing this spring? I am visiting NCAR 2/17 through 3/3 and would enjoy talking with folks about what we're doing with Pythia Cookbooks.</p>",
        "id": 74313,
        "sender_full_name": "Brian Rose",
        "timestamp": 1676470514
    },
    {
        "content": "<p>Yes the forums are still happening! I'm not sure if we have an open slot while you'll be at NCAR, but the forum is hybrid so you can present from home another time if you'd like. Here's the <a href=\"https://docs.google.com/spreadsheets/d/1Tuv5vwGbjSKdJD5KLT0Zow8WCY0_zt35tTI6EIRGOk4/edit?usp=drivesdk\">sign up sheet</a>. <span class=\"user-mention\" data-user-id=\"311\">@Elena Romashkova</span> and I run the forum, so let us know if you have any questions</p>",
        "id": 74314,
        "sender_full_name": "Heather Craker",
        "timestamp": 1676472316
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"107\">@Heather Craker</span> and <span class=\"user-mention\" data-user-id=\"311\">@Elena Romashkova</span>, I couldn't access the sign up sheet but I met with John Clyne this morning and got signed up for an open date April 17.</p>",
        "id": 74572,
        "sender_full_name": "Brian Rose",
        "timestamp": 1676658027
    },
    {
        "content": "<p>Hi Brian. Sorry you couldn't access the sign up sheet. I can add you to the list of editors for the sheet. I'm looking forward to your presentation! Let us know if you have any questions</p>",
        "id": 74573,
        "sender_full_name": "Heather Craker",
        "timestamp": 1676658123
    },
    {
        "content": "<p>I think it would be nice to have Brian present off-schedule (like we did with Hauke) so that follow-on in-person meetings will be possible. This is a nice opportunity</p>",
        "id": 74577,
        "sender_full_name": "Deepak Cherian",
        "timestamp": 1676659224
    },
    {
        "content": "<p>I think that would be possible. <span class=\"user-mention\" data-user-id=\"311\">@Elena Romashkova</span> and I will chat about it and see if we can get a room. No guarantees, but we can do our best!</p>",
        "id": 74579,
        "sender_full_name": "Heather Craker",
        "timestamp": 1676659381
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 74580,
        "sender_full_name": "Deepak Cherian",
        "timestamp": 1676659522
    },
    {
        "content": "<p>That would be great if it works out!</p>",
        "id": 74642,
        "sender_full_name": "Brian Rose",
        "timestamp": 1676746528
    },
    {
        "content": "<p>One more reminder that we've got an extra ESDS forum talk happening this afternoon at 2 with visiting scientist <span class=\"user-mention\" data-user-id=\"49\">@Brian Rose</span> on Project Pythia cookbooks ! It'll be in person in the Mesa Lab Director's Conference Room, and online at <a href=\"http://meet.google.com/ubj-irpf-evd\">meet.google.com/ubj-irpf-evd</a>.</p>",
        "id": 75702,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1677786358
    },
    {
        "content": "<p>Another ESDS forum talk today by <span class=\"user-mention\" data-user-id=\"234\">@Daniel Adriaansen</span>: Using Python's Multiprocessing module to speed up calculations in a non-HPC workflow! This will be at 2 PM, in the Mesa Lab Chapman room and at <a href=\"http://meet.google.com/uya-vqhi-twg\">meet.google.com/uya-vqhi-twg</a>. (The presentation will be virtual, but the room will be set up to watch + discuss)</p>",
        "id": 75982,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1678135258
    },
    {
        "content": "<p>AWSIG Forum on Monday for cloud computing and Casper discussions</p>\n<p>CISL staff will seek user input on two initiatives of interest to the NCAR community during the ESDS forum from 2 to 3 p.m. MDT on Monday, April 3. The forum agenda includes:</p>\n<ol>\n<li>\n<p>An overview of a prototype on/off-premises, cloud-computing project that seeks to complement and extend the capabilities of NCAR’s existing JupyterHub and Casper resources.</p>\n</li>\n<li>\n<p>Community input on plans for a Casper augmentation. CISL would like to hear from users about what they see as the strengths and limitations of the current Casper resources and what should be preserved or changed going forward. Community input will be used in the procurement process for the next generation of Casper hardware.</p>\n</li>\n</ol>\n<p>All users with an interest in the future of NCAR’s data analysis resources are welcome to <a href=\"https://meet.google.com/uya-vqhi-twg\">participate remotely</a> or in the Mesa Lab Chapman Room.</p>",
        "id": 78360,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1680208140
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span>, reminder about the next ESDS Forum this afternoon: Josh Boyle and his team will be giving a talk on Faster Computing on GPUs with ArrayFire. If you're in person please head over to the Mesa Lab Chapman Room at 2pm MT, or join virtually at <a href=\"http://meet.google.com/uya-vqhi-twg\">meet.google.com/uya-vqhi-twg</a>.</p>\n<p>The meeting will start with community updates, which can be super quick/informal and a great way to stay up to date on what others are working on or interested in. See you soon!</p>",
        "id": 80969,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1684169374
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span> ,</p>\n<p>A quick reminder that we have an ESDS Forum this afternoon at 2pm (mountain time)! It will be all virtual at <a href=\"http://meet.google.com/uya-vqhi-twg\">meet.google.com/uya-vqhi-twg</a>. Julia Kent will be giving an update about the Project Pythia Cookoff, a hackathon-style event that was held at the Mesa Lab last week with the goal of producing more Pythia Cookbooks, which are crowd-sourced collections of workflows for the geosciences.</p>\n<p>See you there!</p>",
        "id": 83901,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1687802337
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"*\">@all</span>, reminder that there's an ESDS forum this afternoon! <span class=\"user-mention\" data-user-id=\"141\">@Brian Vanderwende</span>  will be giving a tutorial on <em>Using conda to access and manage analysis environments</em> specific to NCAR HPC systems, which should be of interest to many. This will be at 2 PM MDT, fully virtual at <a href=\"https://meet.google.com/uya-vqhi-tw\">https://meet.google.com/uya-vqhi-tw</a>! See you there :)</p>",
        "id": 86786,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1691425844
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Elena Romashkova</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/86786\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"*\">all</span>, reminder that there's an ESDS forum this afternoon! <span class=\"user-mention silent\" data-user-id=\"141\">Brian Vanderwende</span>  will be giving a tutorial on <em>Using conda to access and manage analysis environments</em> specific to NCAR HPC systems, which should be of interest to many. This will be at 2 PM MDT, fully virtual at <a href=\"https://meet.google.com/uya-vqhi-tw\">https://meet.google.com/uya-vqhi-tw</a>! See you there :)</p>\n</blockquote>\n<p>Here's the link to the recording of the conda + AWSIG announcements portion of the forum if anyone wasn't able to make it! <a href=\"https://drive.google.com/file/d/1wENX4ipRwhXQ5coFOSbtXCAMXkl_UF1P/view?usp=sharing\">https://drive.google.com/file/d/1wENX4ipRwhXQ5coFOSbtXCAMXkl_UF1P/view?usp=sharing</a></p>",
        "id": 86809,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1691444296
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span>,</p>\n<p>A quick reminder that Elena Romashkova and I will be giving a SciPy 2023 Recap presentation at our Earth System Data Science (ESDS) Forum today at 2pm MDT.  As usual we'll have time from some quick announcements and stand-ups at the beginning and discussion at the end.  </p>\n<p>You can find the <a href=\"https://meet.google.com/uya-vqhi-tw\">Google Meet link here</a> or on the ESDS calendar.  Please share with any colleagues you think might be interested.</p>\n<p>We hope to see you there!</p>",
        "id": 87443,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1692630152
    },
    {
        "content": "<p>Related: <a href=\"https://www.youtube.com/playlist?list=PL1PbeFStIOoOd01KhBeba-byU5E5dJ716\">SciPy 2023 talk videos</a> are finally uploaded</p>",
        "id": 87753,
        "sender_full_name": "Drew Camron",
        "timestamp": 1692912329
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span> !</p>\n<p>A quick reminder that we have our Earth System Data Science (ESDS) Forum today at 2pm MDT.  Keith Lindsay will be presenting on “Using catalogs for model diagnostics.”</p>\n<p>As usual, we'll have time for some quick announcements and updates at the beginning and discussion at the end.  </p>\n<p>You can find the <a href=\"https://meet.google.com/uya-vqhi-tw\">Google Meet link here</a> or on the ESDS calendar. Please share with any colleagues you think might be interested.</p>\n<p>We hope to see you there!</p>",
        "id": 88881,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1695056705
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span> !</p>\n<p>A quick reminder that we have our Earth System Data Science (ESDS) Forum today at 2pm MDT. Philip Chmielowiec will be presenting on “Unstructured Grid Visualization with UXarray.”</p>\n<p>As usual, we'll have time for some quick announcements and updates at the beginning and discussion at the end.</p>\n<p>You can find the <a href=\"http://meet.google.com/uya-vqhi-twg\">Google Meet link here</a> or on the ESDS calendar. Please share with any colleagues you think might be interested.</p>\n<p>We hope to see you there!</p>",
        "id": 89551,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1696256377
    },
    {
        "content": "<p>There's an ESDS forum this upcoming Monday, with Joseph Gum presenting on \"Caring for the data in 'Data Science.'\" I'll send out another reminder then, but in the meantime be thinking about any announcements or updates  you might have to share at the beginning of the forum! Link to add topics to the agenda <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">here</a>, but spur of the moment additions are always welcome too :)</p>",
        "id": 90309,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1697228177
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Elena Romashkova</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/90309\">said</a>:</p>\n<blockquote>\n<p>There's an ESDS forum this upcoming Monday, with Joseph Gum presenting on \"Caring for the data in 'Data Science.'\" I'll send out another reminder then, but in the meantime be thinking about any announcements or updates  you might have to share at the beginning of the forum! Link to add topics to the agenda <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">here</a>, but spur of the moment additions are always welcome too :)</p>\n</blockquote>\n<p>Happening in 15 minutes here! <a href=\"http://meet.google.com/uya-vqhi-twg\">meet.google.com/uya-vqhi-twg</a></p>",
        "id": 90337,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1697485511
    },
    {
        "content": "<p>Hello Everyone, <br>\nIn preparation for our upcoming ESDS/ASWIG Dask discussions, we're interested to better understand user experiences and challenges related to adopting Dask to your workflows. Please take ~2 minutes to fill out <a href=\"https://forms.gle/9tsMufwGnif4iK7U8\">this short survey</a>.</p>\n<p>Thank you!<br>\nNegin</p>",
        "id": 90652,
        "sender_full_name": "Negin Sobhani",
        "timestamp": 1698189744
    },
    {
        "content": "<p>Hi all,</p>\n<p>A quick reminder about the ESDS Forum / AWSIG Discussion on Dask this afternoon from 2-3 pm MDT!</p>\n<p><a href=\"https://forms.gle/9tsMufwGnif4iK7U8\">Pre-event survey</a><br>\n<a href=\"http://meet.google.com/uya-vqhi-twg\">Google Meet link</a></p>",
        "id": 90812,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1698679072
    },
    {
        "content": "<p>One more reminder to think about any quick updates you might like to share with ESDS as well!   Think resources, upcoming events, work you'd like to share, challenges, etc.</p>\n<p>Please add them to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a> in the \"community updates\" section whenever you have a moment.</p>",
        "id": 90823,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1698691388
    },
    {
        "content": "<p>A heads up that we have our next ESDS forum coming up this Monday 11/13 at 2 PM! The title is <strong>NCAR GIS Program - Advancing actionable and convergent Earth System Science with geographic information science and technology, geospatial analytics, and geovisualizations</strong>, and it'll be presented by Olga Wilhelmi, Jennifer Boehnert, Kevin Sampson, and Matt Casali. This talk will also be recorded in case you can't make it!</p>",
        "id": 91722,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1699658083
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Elena Romashkova</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/91722\">said</a>:</p>\n<blockquote>\n<p>A heads up that we have our next ESDS forum coming up this Monday 11/13 at 2 PM! The title is <strong>NCAR GIS Program - Advancing actionable and convergent Earth System Science with geographic information science and technology, geospatial analytics, and geovisualizations</strong>, and it'll be presented by Olga Wilhelmi, Jennifer Boehnert, Kevin Sampson, and Matt Casali. This talk will also be recorded in case you can't make it!</p>\n</blockquote>\n<p>This is today! Link here: <a href=\"http://meet.google.com/uya-vqhi-twg\">meet.google.com/uya-vqhi-twg</a></p>",
        "id": 91748,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1699901342
    },
    {
        "content": "<p>Is Olga's recorded talk (NCAR GIS) online yet?</p>",
        "id": 91907,
        "sender_full_name": "David Ahijevych",
        "timestamp": 1700150977
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"243\">David Ahijevych</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/91907\">said</a>:</p>\n<blockquote>\n<p>Is Olga's recorded talk (NCAR GIS) online yet?</p>\n</blockquote>\n<p>Here's the link: <a href=\"https://drive.google.com/file/d/1XpdkFzF7GIMP9a5f1NuQo4eiw7Mezs9s/view?usp=sharing\">https://drive.google.com/file/d/1XpdkFzF7GIMP9a5f1NuQo4eiw7Mezs9s/view?usp=sharing</a></p>\n<p>It should be in the meeting notes as well as attached to the calendar event.</p>",
        "id": 91909,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1700151338
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span> ,</p>\n<p>Please join us for a special hybrid ESDS Forum this morning at 11am MST on <a href=\"http://meet.google.com/uya-vqhi-twg\">Google Meet</a> and in ML-245 (Chapman Room)!  <a href=\"https://uk.linkedin.com/in/caroline-bain-b2984475\">Caroline Bain</a>, an Enterprise Architect at the UK Met Office, will be sharing a bit about her role and work at the Met Office.</p>\n<p>A quick reminder to add any updates (resources, upcoming events, work you'd like to share, challenges, etc.) you might like to share with ESDS to the <a href=\"http://[url](https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit)\">community updates section of the meeting notes</a> as well! </p>\n<p>Hope to see you there!</p>",
        "id": 92751,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1701706129
    },
    {
        "content": "<p>ESDS forums are back for the new year! This Monday 1/8 at 2 PM MST, <span class=\"user-mention\" data-user-id=\"54\">@Doug Schuster</span> will be presenting on Data Commons and <span class=\"user-mention\" data-user-id=\"342\">@Nick Cote</span> will be presenting on the NSF NCAR Cloud Pilot Project. <a href=\"http://meet.google.com/mfb-whpi-tnj\">Here's</a> the Google Meet link (note it's a new one for 2024!). </p>\n<p>As always, if you have anything to share with the ESDS community, please add items to the community updates section of the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit#heading=h.3a90k73budbe\">meeting notes</a>, or just speak up during that part of the forum!</p>",
        "id": 93950,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1704478826
    },
    {
        "content": "<p>A quick reminder to join us this afternoon for the ESDS Forum at 2pm MT!  Details above.</p>",
        "id": 93995,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1704736487
    },
    {
        "content": "<p>Hi everyone, we've got another ESDS forum this afternoon! It'll be at 2 PM MST at the <a href=\"http://meet.google.com/mfb-whpi-tnj\">usual link</a>. I'll share some resources of interest to the ESDS community from AGU this past December, as well as a quick recap of the ESDS annual event a few weeks ago, and <span class=\"user-mention\" data-user-id=\"114\">@Anissa Zacharias</span> will present on <strong>Benchmarking your Scientific Python Packages using ASV and GitHub Actions</strong>. Hope to see you all there!</p>",
        "id": 95470,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1707156735
    },
    {
        "content": "<p>Additionally, if you have any short updates (e.g. resources, upcoming events, etc.) you would like to share, please add them to the “community updates” section of the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>.</p>\n<p>This would be a great spot for any additional interesting or exciting takeaways from AGU/AMS!</p>",
        "id": 95472,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1707157327
    },
    {
        "content": "<p>Was this forum recorded? I was on PTO but am severely interested in hearing about other folks' library benchmarking experience!</p>",
        "id": 95515,
        "sender_full_name": "Drew Camron",
        "timestamp": 1707235393
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"169\">Drew Camron</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/95515\">said</a>:</p>\n<blockquote>\n<p>Was this forum recorded? </p>\n</blockquote>\n<p>It wasn't, but the slides are linked in the notes (<a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit#:~:text=ASV%2DESDS%2D02052024.pdf\">or here</a>) and there are a few links in the meeting notes.</p>\n<p>If there's interest in some follow on discussion, we could create a topic in here as well.</p>",
        "id": 95518,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1707235751
    },
    {
        "content": "<p>Perfect, thank you! <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 95519,
        "sender_full_name": "Drew Camron",
        "timestamp": 1707236096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"169\">@Drew Camron</span> also feel free to email/DM me if you want to chat more! I'm absolutely down to hear any suggestions and/or talk your ear off about our experience so far with benchmarking</p>",
        "id": 95522,
        "sender_full_name": "Anissa Zacharias",
        "timestamp": 1707236879
    },
    {
        "content": "<p>Hi everyone!  </p>\n<p>Join us this coming Monday, March 18th at 2 PM MT on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a> for the next ESDS Forum!  Drew Camron and Ryan May will be presenting on MetPy giving a brief intro, some updates, and leaving plenty of time for community discussion and feedback.</p>\n<p>As always, if you have anything to share with the ESDS community, please add items to the community updates section of the meeting notes, and/or speak up during that part of the forum!</p>\n<p>See you there!</p>",
        "id": 96687,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1710440830
    },
    {
        "content": "<p>A quick reminder that we have an ESDS Forum this afternoon at 2PM MT on MetPy (details above)!</p>\n<p>If you have any updates you'd like to share with the ESDS community please jot them down in the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>.</p>",
        "id": 96748,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1710779217
    },
    {
        "content": "<p>Hi everyone!</p>\n<p>Join us this coming Monday, April 1st at 2 PM MT on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a> for the next ESDS Forum! Adrianna Foster and Sam Rabin will be presenting on VS Code and giving a brief demo. We'll follow up with some Q&amp;A and discussion. </p>\n<p>As always, if you have anything to share with the ESDS community, please add items to the community updates section of the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, and/or speak up during that part of the forum!</p>\n<p>See you there!</p>\n<p>Katelyn and Lev</p>",
        "id": 97212,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1711576802
    },
    {
        "content": "<p>A quick reminder that we have an ESDS Forum this afternoon at 2PM MT on VS Code (details above)!</p>\n<p>If you have any updates you'd like to share with the ESDS community please jot them down in the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes.</a>.</p>",
        "id": 97361,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1711992151
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"234\">@Daniel Adriaansen</span>, Thanks so much for your message. What time is the ESDS Committee Meeting on April 08? I would be happy to attend this to discuss some ideas. I have a training on Monday afternoon, but I should be able to get out of the training for 10-15 minutes to discuss this at the ESDS meeting. Thanks again, <span class=\"user-mention\" data-user-id=\"19\">@John Clyne</span> and <span class=\"user-mention\" data-user-id=\"234\">@Daniel Adriaansen</span>, for coordinating this.</p>",
        "id": 97540,
        "sender_full_name": "Negin Sobhani",
        "timestamp": 1712340720
    },
    {
        "content": "<p>Heads up about our next ESDS forum this coming Monday, April 15th at 2 PM MT on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a>! <span class=\"user-mention\" data-user-id=\"313\">@Thomas Martin</span> will be giving a talk on the following two topics:</p>\n<ol>\n<li>\n<p>Short discussion on JAX drop in for numpy : <a href=\"https://jax.readthedocs.io/en/latest/jax-101/01-jax-basics.html\">https://jax.readthedocs.io/en/latest/jax-101/01-jax-basics.html</a></p>\n</li>\n<li>\n<p>Xarray to ML package of choice. We all love xarray datasets for rich metadata, attributes, and units. What are some of the best practices and workflows to reattach these after doing ML analysis? This will be an open discussion about the gaps, current best practices, and where future development needs to be.</p>\n</li>\n</ol>\n<p>Be thinking about any announcements or updates you might have for the community updates portion, and add them to  the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a> if you think of them ahead of time!</p>",
        "id": 97757,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1712952043
    },
    {
        "content": "<p>A quick reminder about the ESDS Forum this afternoon at 2pm on arrays and metadata in ML workflows (see the detailed description above).  Join us on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a>!</p>\n<p>And a reminder to add any resources, events, suggestions, etc. you'd like to share to the community updates section of the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>.</p>",
        "id": 97821,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1713200769
    },
    {
        "content": "<p>Hi everyone!</p>\n<p>Join us this coming Monday, April 29th at 2 PM MT on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a> for the next ESDS Forum!  Julius J.M. Busecke from Columbia University will be presenting on ARCO Data with Pangeo-Forge (see below for the full title and description). </p>\n<p>As always, if you have anything to share with the ESDS community, please add items to the community updates section of the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>.</p>\n<p>See you there! </p>\n<p><strong>Title:</strong> Analysis-Ready Cloud-Optimized Data for your community and the entire world with Pangeo-Forge</p>\n<p><strong>Description:</strong> Open Data is the bedrock of open, collaborative, and reproducible science. In this seminar I will show two different use cases to ingest climate data into analysis-ready cloud-optimized formats -- The LEAP community Pangeo-Forge Bakery and the Pangeo/ESGF Zarr Bakery. I will present challenges and successes, and invite a broader discussion about how to serve both your community and the broader public with open data.</p>",
        "id": 98318,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1714157506
    },
    {
        "content": "<p>A quick reminder about the ESDS Forum this afternoon at 2pm from Julius Busecke of Columbia University on Analysis-Ready Cloud-Optimized Data with Pangeo-Forge (see the detailed description above). Join us on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a>!</p>\n<p>And a reminder to add any resources, events, suggestions, etc. you'd like to share to the community updates section of the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>.</p>",
        "id": 98368,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1714411322
    },
    {
        "content": "<p>We have another ESDS forum coming up this Monday at 2 PM MT on <a href=\"https://meet.google.com/mfb-whpi-tnj\">Google Meet</a>! Matt Mayernik and Bob Dattore will be presenting on <strong>FAIR Data, Data Repositories, and Data Citation</strong>.</p>\n<p>Description:<br>\nThis talk will overview NSF NCAR support for enabling data to be \"FAIR\" - Findable, Accessible, Interoperable, and Reusable. We will also outline work within NSF NCAR to trace the impact of data, software, and other resources through compiling citations from several external services.</p>\n<p>Remember to add community updates, which can include things like resources, updates on projects, events to share, etc. to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>",
        "id": 99155,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1715373099
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Lev Romashkov</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/99155\">said</a>:</p>\n<blockquote>\n<p>We have another ESDS forum coming up this Monday at 2 PM MT on <a href=\"https://meet.google.com/mfb-whpi-tnj\">Google Meet</a>! Matt Mayernik and Bob Dattore will be presenting on <strong>FAIR Data, Data Repositories, and Data Citation</strong>.</p>\n<p>Description:<br>\nThis talk will overview NSF NCAR support for enabling data to be \"FAIR\" - Findable, Accessible, Interoperable, and Reusable. We will also outline work within NSF NCAR to trace the impact of data, software, and other resources through compiling citations from several external services.</p>\n<p>Remember to add community updates, which can include things like resources, updates on projects, events to share, etc. to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n</blockquote>\n<p>Reminder that this is today - see you there!</p>",
        "id": 99180,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1715621535
    },
    {
        "content": "<p>There's another ESDS forum this Monday, June 24th at 2 PM MT on <a href=\"https://meet.google.com/mfb-whpi-tnj\">Google Meet</a>! DJ Gagne will be talking to us about the MILES group's work on machine learning software.</p>\n<p>As usual, there will be time for community updates at the beginning. Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>",
        "id": 101176,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1718985270
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"311\">Lev Romashkov</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/101176\">said</a>:</p>\n<blockquote>\n<p>There's another ESDS forum this Monday, June 24th at 2 PM MT on <a href=\"https://meet.google.com/mfb-whpi-tnj\">Google Meet</a>! DJ Gagne will be talking to us about the MILES group's work on machine learning software.</p>\n<p>As usual, there will be time for community updates at the beginning. Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n</blockquote>\n<p>This is today - see you all in a few hours!</p>",
        "id": 101206,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1719250291
    },
    {
        "content": "<p>Next ESDS forum this Monday, July 22nd at 2 PM MT on <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a>! Ben Kirk will be giving an AWSIG (Analysis Workflow Special Interest Group) update focused on the Casper augmentation project.</p>\n<p>Description:<br>\nOver the past year CISL has begun adding additional resources to the Casper data analysis and visualization cluster across all node classes.  We will overview the resources that have already been added - H100-equipped GPGPUs, visualization resources with L40 graphics cards, and additional high-memory nodes.  We will also outline the process and timeline for the additional high-throughput computing nodes planned for later this calendar year.</p>\n<p>There will be time for community updates at the beginning. As a reminder, this is a very open-ended category - ideas include sharing a coding resource or event, asking the room for advice on a data science problem you're having, or sharing something cool from a project you're working on. Visiting students, interns, etc. would be especially welcome to share! To give a community update, add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit?usp=sharing\">meeting notes</a> or just speak up at the forum.</p>",
        "id": 102611,
        "sender_full_name": "Lev Romashkov",
        "timestamp": 1721335751
    },
    {
        "content": "<p>Hi all, </p>\n<p>No ESDS Forum today.  We'll resume September 16th.  See you then!</p>",
        "id": 103861,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1724082887
    },
    {
        "content": "<p>Hi all ,</p>\n<p>We'll be kicking off the fall season of the ESDS Forum today at 2pm MDT with Joseph Gum sharing about archiving on Zenodo for NSF NCAR. </p>\n<p>As usual we'll have time for some announcements and community updates at the beginning and discussion at the end.  Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n<p>You can find the <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet link here</a> or on the ESDS calendar.</p>\n<p>Please share with any colleagues you think might be interested.</p>\n<p>Hope to see you there!</p>",
        "id": 104254,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1726502578
    },
    {
        "content": "<p>Hi all,</p>\n<p>Next Monday we’ll have Wai Allen presenting “Indigenous Perspectives on Data Management: Rising Voices Changing Coasts Geosciences Hub” during the ESDS Forum at 2pm MDT (full description below).</p>\n<p>As usual we'll have time for some announcements and community updates at the beginning and discussion at the end. Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n<p>You can find the <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet link here</a> or on the ESDS calendar.</p>\n<p>Please share with any colleagues you think might be interested.</p>\n<p>Hope to see you there!</p>\n<p>Katelyn</p>\n<p><strong>Indigenous Perspectives on Data Management: Rising Voices Changing Coasts Geosciences Hub</strong><br>\nWai Allen</p>\n<p><em>Convergence research settings are critical areas for Indigenous communities to address pressing societal needs by engaging with an intellectually diverse cohort of researchers. Inclusion of Indigenous knowledge systems into these settings are critical for engagement of Indigenous communities, however, challenges often exist in the process and method of engagement between Indigenous communities and physical and social scientists from academic and federal institutions.</em></p>",
        "id": 104409,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1727387453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"339\">Katelyn FitzGerald</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/104409\">said</a>:</p>\n<blockquote>\n<p>Hi all,</p>\n<p>Next Monday we’ll have Wai Allen presenting “Indigenous Perspectives on Data Management: Rising Voices Changing Coasts Geosciences Hub” during the ESDS Forum at 2pm MDT (full description below).</p>\n<p>As usual we'll have time for some announcements and community updates at the beginning and discussion at the end. Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n<p>You can find the <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet link here</a> or on the ESDS calendar.</p>\n<p>Please share with any colleagues you think might be interested.</p>\n<p>Hope to see you there!</p>\n<p>Katelyn</p>\n<p><strong>Indigenous Perspectives on Data Management: Rising Voices Changing Coasts Geosciences Hub</strong><br>\nWai Allen</p>\n<p><em>Convergence research settings are critical areas for Indigenous communities to address pressing societal needs by engaging with an intellectually diverse cohort of researchers. Inclusion of Indigenous knowledge systems into these settings are critical for engagement of Indigenous communities, however, challenges often exist in the process and method of engagement between Indigenous communities and physical and social scientists from academic and federal institutions.</em></p>\n</blockquote>\n<p>A quick reminder about the ESDS Forum this afternoon (see details above).</p>",
        "id": 104426,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1727720273
    },
    {
        "content": "<p>Hi all,</p>\n<p>Next Monday we’ll have Anissa Zacharias sharing about a new GeoCAT resource (description below) and Nick Cote giving a short update on the CISL On-Prem Cloud project during the ESDS Forum at 2pm MDT.</p>\n<p>As usual we'll have time for some announcements and community updates at the beginning and discussion at the end. Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n<p>You can find the <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet link here</a> or on the ESDS calendar.</p>\n<p>Please share with any colleagues you think might be interested.</p>\n<p>Hope to see you there!</p>\n<p>Katelyn</p>\n<p><strong>GeoCAT Applications</strong><br>\nAnissa Zacharias</p>\n<p><em>This talk will overview a new GeoCAT project, GeoCAT Applications, and provide a space for early feedback into its development. GeoCAT Applications is a community resource inspired by the NCL Applications page that aims to connect existing tools in the python ecosystem with geoscience applications.</em></p>",
        "id": 104630,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1729790435
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"339\">Katelyn FitzGerald</span> <a href=\"#narrow/stream/41-ESDS/topic/ESDS.20Forum/near/104630\">said</a>:</p>\n<blockquote>\n<p>Hi all,</p>\n<p>Next Monday we’ll have Anissa Zacharias sharing about a new GeoCAT resource (description below) and Nick Cote giving a short update on the CISL On-Prem Cloud project during the ESDS Forum at 2pm MDT.</p>\n<p>As usual we'll have time for some announcements and community updates at the beginning and discussion at the end. Please think about anything you might have to share and add items to the <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">meeting notes</a>, or just speak up at the forum!</p>\n<p>You can find the <a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet link here</a> or on the ESDS calendar.</p>\n<p>Please share with any colleagues you think might be interested.</p>\n<p>Hope to see you there!</p>\n<p>Katelyn</p>\n<p><strong>GeoCAT Applications</strong><br>\nAnissa Zacharias</p>\n<p><em>This talk will overview a new GeoCAT project, GeoCAT Applications, and provide a space for early feedback into its development. GeoCAT Applications is a community resource inspired by the NCL Applications page that aims to connect existing tools in the python ecosystem with geoscience applications.</em></p>\n</blockquote>\n<p>A quick reminder about this afternoon's ESDS Forum.  Details <span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span> .</p>",
        "id": 104635,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1730134980
    },
    {
        "content": "<p>Hi all, </p>\n<p>There will be no ESDS Forum Monday, November 11th.</p>\n<p>Hope to see you later this month!</p>",
        "id": 104745,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1731088736
    },
    {
        "content": "<p>Hi all,</p>\n<p>There will be no ESDS Forum Monday, November 25th over the holiday week.  </p>\n<p>However, you can look forward to a special seminar \"Data Access for km-Scale Resolution Models\" from Florian Ziemen of DKRZ on Tuesday December 3rd from 9-10am MT.  More information and a link to the calendar event below.</p>\n<p><a href=\"https://calendar.google.com/calendar/event?action=TEMPLATE&amp;tmeid=NjJ2YmNtZjRlY3RpaW1vNnNxMGNzc25rdmsgY19uaHBwaGMwbW0wbWhtcGk3bWliamgydDVkY0Bn&amp;tmsrc=c_nhpphc0mm0mhmpi7mibjh2t5dc%40group.calendar.google.com\">Calendar Event</a></p>\n<p>Title: Data Access for km-scale Resolution Models<br>\nPresenter: Florian Ziemen (DKRZ)</p>\n<p>Abstract:<br>\nWith the transition to global, km-scale simulations, model outputs have grown in size, and efficient ways of accessing data have become more important than ever. This implies that the data storage has to be optimized for efficient read access to small sub-sets of the data, and multiple resolutions of the same data need to be provided for efficient analysis on coarse as well as fine-grained scales.</p>\n<p>I will present the approach currently taken by DKRZ and the Max-Planck-Institute for Meteorology in the context of km-scale resolution projects like nextGEMS and the upcoming WCRP Digital Earths global hackathon. We minimize the data users need to load to perform their analyses by remapping the data to the healpix grid, and creating a hierarchy of resolutions in space and time. Listing these datasets in catalogs provides convenient access for users and allows to move data between storage media without bothering the users. Using zarr via https as standard access protocol even enables remote users to easily analyze data stored at DKRZ or any other center.</p>",
        "id": 104972,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1732223135
    },
    {
        "content": "<p>A belated update on the ESDS Forum:</p>\n<p>I'll get the calendar and sign up sheet updated soon, but you can plan on the ESDS Forum picking back up in February of the new year.  If you're have any folks you'd like to hear from, things you'd like to share, or particular topics of interest, please reach out to me at <a href=\"mailto:katelynw@ucar.edu\">katelynw@ucar.edu</a>.</p>\n<p>In the meantime, I hope everyone has a lovely winter holiday and conference season.  See you in the new year!</p>",
        "id": 105196,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1734629595
    },
    {
        "content": "<p>Happy New Year! </p>\n<p>The <a href=\"https://docs.google.com/spreadsheets/d/1Tuv5vwGbjSKdJD5KLT0Zow8WCY0_zt35tTI6EIRGOk4/edit?gid=0#gid=0\">ESDS Forum sign up sheet</a> is now updated for spring 2025.  Feel free to grab a time slot if you have something you'd like to share and please reach out with any questions or suggestions!</p>",
        "id": 105242,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1736274345
    },
    {
        "content": "<p>Hi all,</p>\n<p>No presentation for today, but we will plan to hold an abbreviated ESDS Forum.  I know a few folks have updates on events, resources, etc. they'd like to share.  <a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit?tab=t.0#heading=h.6x9nj0dkaxp7\">Meeting notes here</a>.  Please drop a note in the community updates section if you have anything you'd like to share (e.g. interesting projects you heard about at AMS / AGU, new resources / tutorials, upcoming events, etc.).</p>\n<p>Also, <span class=\"user-mention\" data-user-id=\"389\">@Harsha Hampapura</span> (our new ESDS Forum co-organizer!) and I are working on spring 2025 schedule if you have any suggestions for presenters and/or might like to share your work this spring.  Go ahead and <a href=\"https://www.google.com/url?q=https://docs.google.com/spreadsheets/d/1Tuv5vwGbjSKdJD5KLT0Zow8WCY0_zt35tTI6EIRGOk4/edit?usp%3Dsharing&amp;sa=D&amp;source=calendar&amp;ust=1738868852118638&amp;usg=AOvVaw2kzbI28v3cwM5leJEnqY6H\">sign up here</a> and/or reach out to us with any questions.</p>",
        "id": 105478,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1738606680
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"*\">@all</span> ,</p>\n<p>Please join us for the ESDS Forum this afternoon from 2-3p!  Doug Schuster and Harsha Hampapura will be presenting updates on the NSF NCAR Data Commons.</p>\n<p>As usual, if you have any updates you'd like to share (resources, events, tips, etc.) please add them to the community updates section of the meeting notes.  </p>\n<p>Hope to see you there!</p>\n<p><a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a><br>\n<a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">Meeting Notes</a></p>",
        "id": 105733,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1741025058
    },
    {
        "content": "<p>Hi @all ,</p>\n<p>Please join us for the ESDS Forum this afternoon from 2-3p!  Valerio Pascucci and Aashish Panta from the University of Utah will be presenting on OpenViSUS for scientific visualization (full abstract below).</p>\n<p>As usual, if you have any updates you'd like to share (resources, events, tips, etc.) please add them to the community updates section of the meeting notes.</p>\n<p>Hope to see you there!</p>\n<p><a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a><br>\n<a href=\"https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">Meeting Notes</a></p>\n<p>OpenVISUS for Petascale scientific visualization</p>\n<p>Scientists generate petabytes of data to help uncover environmental trends or behaviors that are hard to predict. For example, understanding climate simulations based on the long-term average of temperature, precipitation, and other environmental variables is essential to predicting and establishing root causes of future undesirable scenarios and assessing possible mitigation strategies. While supercomputer centers provide a powerful infrastructure for generating petabytes of simulation output, accessing and analyzing these datasets interactively remains challenging on multiple fronts. We present an approach to managing, visualizing, and analyzing petabytes of data within a browser on equipment ranging from the top NASA supercomputer to commodity hardware like a laptop. We provide customizable dashboards that can visualize petabytes of data and can be accessed from any device with any internet connection, enabling interactive analysis of vast amounts of data to a wide range of users - from top scientists with access to leadership-class computing environments to undergraduate students of disadvantaged backgrounds from minority-serving institutions. We focus on NASA's use of petascale climate datasets as an example of particular societal impact and, therefore, a case where achieving broader science participation is critical.</p>",
        "id": 105881,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1742224200
    },
    {
        "content": "<p>Hi all ,</p>\n<p>Please join us for the ESDS Forum next Monday from 2-3p!  We'll have Eric Neinhouse presenting on Enabling a Science Gateway at NCAR and Pablo Lichtig presenting on MELODIES-MONET.</p>\n<p>As usual, if you have any updates you'd like to share (resources, events, tips, etc.) please add them to the community updates section of the meeting notes.</p>\n<p>Hope to see you there!</p>\n<p><a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a><br>\n<a href=\"https://www.google.com/url?q=https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">Meeting Notes</a></p>",
        "id": 105934,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1743098511
    },
    {
        "content": "<p>A quick reminder about the ESDS Forum this afternoon (see above for details).</p>\n<p>Hope to see you there!</p>",
        "id": 105950,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1743437222
    },
    {
        "content": "<p>Hi all ,</p>\n<p>Please join us for the ESDS Forum next Monday from 2-3p! We'll have Brian Bockelman from the Morgridge Institute for Research presenting on the Open Science Data Federation (OSDF) - Connecting the Nation's Datasets.</p>\n<p>As usual, if you have any updates you'd like to share (resources, events, tips, etc.) please add them to the community updates section of the meeting notes.</p>\n<p>Hope to see you there!</p>\n<p><a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a><br>\n<a href=\"https://www.google.com/url?q=https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">Meeting Notes</a></p>",
        "id": 106105,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1744406263
    },
    {
        "content": "<p>A quick reminder about this afternoon's ESDS Forum. Details and links above and here's a brief description of the presentation:</p>\n<blockquote>\n<p>The Open Science Data Federation (OSDF) is an NSF-funded service that connects the nation's disparate scientific dataset repositories into a single fabric.  The OSDF aims to cover a broad swath of science content, including NCAR's Research Data Archive, providing high throughput access for workflows with high levels of reuse.</p>\n<p>In this talk, we'll go cover the basics goals of the OSDF, how the technologies work \"under the hood\", the targeted user experiences, and where the project is headed to next.</p>\n</blockquote>",
        "id": 106113,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1744648498
    },
    {
        "content": "<p>Hi all ,</p>\n<p>Please join us for the ESDS Forum next Monday from 2-3p! We'll have Max Grover from Argonne National Laboratory presenting on intake-esm vs intake-esgf and Nick Cote from CISL presenting the new CIRRUS Cloud.  Full descriptions below.</p>\n<p>As usual, if you have any updates you'd like to share (resources, events, tips, etc.) please add them to the community updates section of the meeting notes.</p>\n<p>Hope to see you there!</p>\n<p><a href=\"http://meet.google.com/mfb-whpi-tnj\">Google Meet</a><br>\n<a href=\"https://www.google.com/url?q=https://docs.google.com/document/d/13lpcxSWmcdeguchuGxmAG895w1HMQRexCGIxjxDZ8YQ/edit\">Meeting Notes</a></p>\n<p>Intake-ESM vs Intake-ESGF</p>\n<blockquote>\n<p>Max Grover works as an Atmospheric Data Scientist at Argonne National Laboratory, where he works with the U.S. Department of Energy supported Earth System Grid Federation project. During this presentation, he will give an overview of two different Python tools for working with petabyte-scale earth system model data collections: intake-esm and intake-esgf. Key differences between the two will be highlighted, with examples of what should be used when in addition to the general philosophies of the toolkits, and roadmaps moving forward.</p>\n</blockquote>\n<p>CIRRUS Cloud</p>\n<blockquote>\n<p>An introduction to the new Cloud Infrastructure for Remote Research, Universities, and Scientists platform named CIRRUS. The presentation will cover how CIRRUS can be utilized to complement existing HPC resources at NSF NCAR and includes information on how custom applications are deployed as well as the ready to use tools that are available to consume.</p>\n</blockquote>",
        "id": 106182,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1745602265
    },
    {
        "content": "<p>Happening in a few <span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span></p>",
        "id": 106189,
        "sender_full_name": "Katelyn FitzGerald",
        "timestamp": 1745870158
    }
]