[
    {
        "content": "<p>The <a href=\"http://geodynamics.org\">Computational Infrastructure for Geodynamics</a> is offering a workshop on 'Crafting Quality Research Software and Navigating Publication in Software' - see details below (from Earthcube slack channel):</p>\n<p>Ever wonder how and where to publish your software? This two part workshop series is designed to equip researchers and developers with the skills and understanding necessary to produce robust, maintainable, and impactful research software. The workshop takes a hands-on approach, detailing the crucial aspects of research software development - ranging from design, implementation, testing, and documentation to version control and reproducibility. Throughout the sessions, participants will engage with expert facilitators who possess both software development expertise and experience in academic research, ensuring that attendees gain a balanced perspective.</p>\n<p>In addition to the elements of software development, the workshop also offers insights into the process of publishing research software in leading software journals, with a specific focus on the Journal of Open Source Software (JOSS). Participants will learn about the preparation of software papers, adherence to submission guidelines, and the unique aspects of peer-review for software publications. As a result, attendees will be well-prepared not only to create high-quality research software but also to effectively communicate its scientific value, fostering a broader and more impactful dissemination of their research efforts.</p>\n<p>August 10. Part I is a virtual event for everyone interested in building robust software.<br>\nSeptember 9. Part II is all day, in-person hack event with help from experts for teams committed to prepare their software for submission. </p>\n<p>Availability is limited. You must apply to attend<br>\nMore information: <a href=\"https://geodynamics.org/events/details/313/workshop-schedule\">https://geodynamics.org/events/details/313/workshop-schedule</a><br>\nRegister: <a href=\"https://www.eventbrite.com/e/2023-crafting-quality-research-software-and-navigating-publication-registration-639948672707\">https://www.eventbrite.com/e/2023-crafting-quality-research-software-and-navigating-publication-registration-639948672707</a></p>",
        "id": 81561,
        "sender_full_name": "Katie Dagon",
        "timestamp": 1685033698
    }
]