[
    {
        "content": "<p><strong>Atlantic Equatorial Undercurrent intensification counteracts warming-induced deoxygenation</strong>  by Peter Brandt  et al. <br>\n<a href=\"https://www.nature.com/articles/s41561-021-00716-1.pdf\" target=\"_blank\" title=\"https://www.nature.com/articles/s41561-021-00716-1.pdf\">https://www.nature.com/articles/s41561-021-00716-1.pdf</a><br>\nThe tropical Atlantic upper-ocean circulation experiences multiannual to decadal changes associated with different climate<br>\nmodes and is simultaneously adjusting to climate warming. The most energetic current in the tropical Atlantic is the Equatorial<br>\nUndercurrent (EUC), which flows eastwards along the Equator. On the basis of long-term moored observations, we show that<br>\nthe EUC strengthened by more than 20% from 2008 to 2018. The intensification of the EUC is associated with increasing subsurface oxygen concentrations and a thickening of the upper-ocean oxygenated layer in the equatorial Atlantic. These changes<br>\ncounteract climate-warming-induced deoxygenation in the region. The EUC strengthening is found to be mainly forced by trade<br>\nwind changes in the western tropical North Atlantic. A 60-yr dataset reveals that the recent oxygen increase in the upper equatorial Atlantic is associated with multidecadal variability. This variability is characterized by low oxygen concentrations in the<br>\n1990s and early 2000s, and high oxygen concentrations in the 1960s and 1970s. The observed oxygen variability seems to be<br>\nlinked to a compression and expansion of the habitat of tropical pelagic fish, and must be accounted for when evaluating the<br>\npossible consequences of deoxygenation for marine ecosystems and fisheries.</p>",
        "id": 29885,
        "sender_full_name": "Yassir Eddebbar",
        "timestamp": 1618873292
    },
    {
        "content": "<p><strong>Respiratory capacity is twice as important as temperature in explaining patterns of metabolic rate across the vertebrate tree of life</strong>*</p>\n<p><strong>Jennifer S. Bigman *, Leithen K. M’Gonigle, Nicholas C. Wegner, Nicholas K. Dulvy</strong></p>\n<p>Metabolic rate underlies a wide range of phenomena from cellular dynamics to ecosystem structure and function. Models seeking to statistically explain variation in metabolic rate across vertebrates are largely based on body size and temperature. Unexpectedly, these models overlook variation in the size of gills and lungs that acquire the oxygen needed to fuel aerobic processes. Here, we assess the importance of respiratory surface area in explaining patterns of metabolic rate across the vertebrate tree of life using a novel phylogenetic Bayesian multilevel modeling framework coupled with a species-paired dataset of metabolic rate and respiratory surface area. We reveal that respiratory surface area explains twice as much variation in metabolic rate, compared to temperature, across the vertebrate tree of life. Understanding the combination of oxygen acquisition and transport provides opportunity to understand the evolutionary history of metabolic rate and improve models that quantify the impacts of climate change.</p>\n<p><a href=\"https://advances.sciencemag.org/content/7/19/eabe5163\" target=\"_blank\" title=\"https://advances.sciencemag.org/content/7/19/eabe5163\">https://advances.sciencemag.org/content/7/19/eabe5163</a></p>",
        "id": 33764,
        "sender_full_name": "Precious Mongwe",
        "timestamp": 1623143013
    },
    {
        "content": "<p><strong>Summertime increases in upper-ocean stratification and mixed-layer depth</strong></p>\n<p><strong>Jean-Baptiste Sallée, Violaine Pellichero, Camille Akhoudas, Etienne Pauthenet, Lucie Vignes, Sunke Schmidtko, Alberto Naveira Garabato, Peter Sutherland &amp; Mikael Kuusela </strong></p>\n<p>The surface mixed layer of the world ocean regulates global climate by controlling heat and carbon exchange between the atmosphere and the oceanic interior1–3 . The mixed layer also shapes marine ecosystems by hosting most of the ocean’s primary production 4 and providing the conduit for oxygenation of deep oceanic layers. Despite these important climatic and life-supporting roles, possible changes in the mixed layer during an era of global climate change remain uncertain. Here we use oceanographic observations to show that from 1970 to 2018 the density contrast across the base of the mixed layer increased and that the mixed layer itself became deeper. Using a physically based definition of upper-ocean stability that follows different dynamical regimes across the global ocean, we find that the summertime density contrast increased by 8.9 ± 2.7 per cent per decade (10−6 –10 −5 per second squared per decade, depending on region), more than six times greater than previous estimates. Whereas prior work has suggested that a thinner mixed layer should accompany a more stratified upper ocean5–7 , we find instead that the summertime mixed layer deepened by 2.9 ± 0.5 per cent per decade, or several metres per decade (typically 5–10 metres per decade, depending on region). A detailed mechanistic interpretation is challenging, but the concurrent stratification and deepening of the mixed layer are related to an increase in stability associated with surface warming and high-latitude surface freshening8,9 , accompanied by a wind-driven intensification of upper-ocean turbulence10,11 . Our findings are based on a complex dataset with incomplete coverage of a vast area. Although our results are robust within a wide range of sensitivity analyses, important uncertainties remain, such as those related to sparse coverage in the early years of the 1970–2018 period. Nonetheless, our work calls for reconsideration of the drivers of ongoing shifts in marine primary production, and reveals stark changes in the world’s upper ocean over the past five decades.</p>",
        "id": 34125,
        "sender_full_name": "Precious Mongwe",
        "timestamp": 1623400413
    }
]